{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "/var/folders/nv/nmq2kszs29945hght0_1sjcw0000gn/T/ipykernel_5286/712753261.py:3: DeprecationWarning: \n",
      "Pyarrow will become a required dependency of pandas in the next major release of pandas (pandas 3.0),\n",
      "(to allow more performant data types, such as the Arrow string type, and better interoperability with other libraries)\n",
      "but was not found to be installed on your system.\n",
      "If this would cause problems for you,\n",
      "please provide us feedback at https://github.com/pandas-dev/pandas/issues/54466\n",
      "        \n",
      "  import pandas\n"
     ]
    }
   ],
   "source": [
    "import requests\n",
    "from SPARQLWrapper import SPARQLWrapper, JSON\n",
    "import pandas"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 59,
   "metadata": {},
   "outputs": [],
   "source": [
    "class Generator:\n",
    "    def __init__(self, sister_predicates):\n",
    "        self.sparql = SPARQLWrapper(\"https://query.wikidata.org/sparql\")\n",
    "        self.sister_predicates = sister_predicates\n",
    "    \n",
    "    def run_query(self, query):\n",
    "        '''\n",
    "        Description:\n",
    "            Takes in query and requests its output\n",
    "        \n",
    "        Arguments:\n",
    "            query:string\n",
    "        \n",
    "        Returns:\n",
    "            results:JSON\n",
    "        '''\n",
    "\n",
    "        # Set the query and the return format (JSON)\n",
    "        self.sparql.setQuery(query)\n",
    "        self.sparql.setReturnFormat(JSON)\n",
    "\n",
    "        # Perform the query and convert the result to a Python dictionary\n",
    "        results = self.sparql.query().convert()\n",
    "        return results\n",
    "\n",
    "    def find_uri_by_label(self, label):\n",
    "        '''\n",
    "        Description:\n",
    "            Takes in label and outputs its URI\n",
    "        \n",
    "        Arguments:\n",
    "            label:string\n",
    "        \n",
    "        Returns:\n",
    "            uri:string - 'http://www.wikidata.org/entity/XXXXXXX'\n",
    "        '''\n",
    "        \n",
    "        # Create SPARQL query to find the URI for a given label\n",
    "        query = f'''SELECT ?item WHERE {{ \n",
    "                    ?item rdfs:label \"{label.replace('\"', '\\\"')}\"@en.\n",
    "                    SERVICE wikibase:label {{ bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }} \n",
    "                }} LIMIT 1'''\n",
    "        \n",
    "        try:\n",
    "            results = self.run_query(query)\n",
    "\n",
    "            # The first matching URI\n",
    "            binding = results[\"results\"][\"bindings\"][0]\n",
    "            result = binding[\"item\"][\"value\"]\n",
    "            return result\n",
    "        except Exception as e:\n",
    "            print(f\"An error occurred: {e}\")\n",
    "            return None\n",
    "\n",
    "    def find_ID_by_label(self, label):\n",
    "        '''\n",
    "        Description:\n",
    "            Takes in label and outputs its ID\n",
    "        \n",
    "        Arguments:\n",
    "            label:string\n",
    "        \n",
    "        Returns:\n",
    "            id:string - 'QXXXXXX'\n",
    "        '''\n",
    "        uri = self.find_uri_by_label(label)\n",
    "        print(uri)\n",
    "        id = uri.split(\"/\")[-1]\n",
    "        return id\n",
    "\n",
    "    def sister_topic(self, label, exceptions=[], n_items=100):\n",
    "        '''\n",
    "        Description:\n",
    "            Takes in label and outputs n_items related topics\n",
    "        \n",
    "        Arguments:\n",
    "            label:string\n",
    "            exceptions: list - Unimplemented\n",
    "            n_items:int\n",
    "        \n",
    "        Returns:\n",
    "            results:JSON - Sister topics of label\n",
    "            \n",
    "        '''\n",
    "        topicID = self.find_ID_by_label(label)\n",
    "        #########\n",
    "        # exceptions not yet tested\n",
    "        exeptions = [f'FILTER NOT EXISTS {{?item \"{exception}\" }}\\n' for exception in exceptions]\n",
    "        #########\n",
    "        \n",
    "        #SPARQL query to find topics that are similar to the given topic\n",
    "        query = f'''\n",
    "        SELECT ?item ?label WHERE {{\n",
    "            VALUES ?predicates {{ {self.sister_predicates} }}\n",
    "            wd:{topicID} ?predicates ?class.\n",
    "            ?item ?predicates ?class.\n",
    "            ?item rdfs:label ?label.\n",
    "\n",
    "            FILTER(LANG(?label) = \"en\")\n",
    "            FILTER(?item != wd:{topicID})\n",
    "            {\"\\n\".join(exeptions)}\n",
    "            SERVICE wikibase:label {{ bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }}\n",
    "        }}\n",
    "        \n",
    "        LIMIT {n_items}\n",
    "        '''\n",
    "        ###\n",
    "        '''ORDER BY RAND() didn't work\n",
    "        \n",
    "        query = \"\"\"SELECT ?item (GROUP_CONCAT(DISTINCT ?predicate; separator=\", \") AS ?predicates)\n",
    "                    (GROUP_CONCAT(DISTINCT ?label; separator=\", \") AS ?labels) \n",
    "                    WHERE {\n",
    "                        VALUES ?predicate { \"\"\" + predicates + \"\"\" }\n",
    "                        wd:\"\"\" + topicQ + \"\"\" ?predicate ?class.\n",
    "                        ?item ?predicate ?class.\n",
    "                        ?item rdfs:label ?label.\n",
    "                        FILTER(?item != wd:\"\"\" + topicQ + \"\"\")\n",
    "                        \n",
    "                        SERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n",
    "                    }\n",
    "                    GROUP BY ?item\n",
    "                    LIMIT 100\"\"\"'''\n",
    "        ###\n",
    "        results = self.run_query(query)\n",
    "        return results\n",
    "\n",
    "    def display_as_table(self, results, n_items):\n",
    "        '''\n",
    "        Description:\n",
    "            Creates a table of the n_items of the queried results\n",
    "        \n",
    "        Arguments:\n",
    "            results:JSON - sister topics\n",
    "            n_items:int\n",
    "        \n",
    "        Returns:\n",
    "            None\n",
    "        '''\n",
    "        df = pandas.DataFrame.from_dict(results[\"results\"][\"bindings\"][:n_items])\n",
    "        df = df.applymap(lambda x: x[\"value\"])\n",
    "        pandas.set_option('display.max_rows', n_items) # n_items doesnt work here\n",
    "        print(df)\n",
    "\n",
    "    def sparql_question(self, topic_label, predicate_label):\n",
    "        '''\n",
    "        Description:\n",
    "           Creates query based on topic and predicate and outputs results\n",
    "        \n",
    "        Arguments:\n",
    "            topic_label:string\n",
    "            topic_label:string\n",
    "        \n",
    "        Returns:\n",
    "            results:JSON\n",
    "        '''\n",
    "        topicID = self.find_ID_by_label(topic_label)\n",
    "        predicateID = self.find_ID_by_label(predicate_label)\n",
    "\n",
    "        # Define the SPARQL query\n",
    "        sparql_query = f\"\"\"\n",
    "            SELECT ?thing WHERE {{\n",
    "                ?thing wdt:{predicateID} wd:{topicID}.\n",
    "                SERVICE wikibase:label {{ bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }}\n",
    "            }}\n",
    "            LIMIT 10\n",
    "            \"\"\"\n",
    "\n",
    "        return self.run_query(sparql_query)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 60,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "http://www.wikidata.org/entity/Q131748\n",
      "                                         item                 label\n",
      "0         http://www.wikidata.org/entity/Q195             chocolate\n",
      "1      http://www.wikidata.org/entity/Q841470              Vegemite\n",
      "2     http://www.wikidata.org/entity/Q1056554                sambal\n",
      "3     http://www.wikidata.org/entity/Q1268555          Rose hip jam\n",
      "4     http://www.wikidata.org/entity/Q1499073          tomato paste\n",
      "5     http://www.wikidata.org/entity/Q1541119             yuzukoshō\n",
      "6     http://www.wikidata.org/entity/Q1589638                panade\n",
      "7     http://www.wikidata.org/entity/Q2964630      horseradish root\n",
      "8     http://www.wikidata.org/entity/Q2976457               Satsivi\n",
      "9     http://www.wikidata.org/entity/Q4426758  fermented bean paste\n",
      "10       http://www.wikidata.org/entity/Q9896                 pesto\n",
      "11      http://www.wikidata.org/entity/Q29340      sweet bean paste\n",
      "12      http://www.wikidata.org/entity/Q29437                 icing\n",
      "13      http://www.wikidata.org/entity/Q41354               vinegar\n",
      "14      http://www.wikidata.org/entity/Q68065             Idli podi\n",
      "15     http://www.wikidata.org/entity/Q129031              tapenade\n",
      "16    http://www.wikidata.org/entity/Q5098942           chili sauce\n",
      "17    http://www.wikidata.org/entity/Q5195232           curry paste\n",
      "18    http://www.wikidata.org/entity/Q5794326             jaew bong\n",
      "19    http://www.wikidata.org/entity/Q7302262           recado rojo\n",
      "20    http://www.wikidata.org/entity/Q8563413            fish paste\n",
      "21   http://www.wikidata.org/entity/Q10752679            nut butter\n",
      "22   http://www.wikidata.org/entity/Q11748113             Creamogen\n",
      "23   http://www.wikidata.org/entity/Q17680151       Eggplant Caviar\n",
      "24   http://www.wikidata.org/entity/Q24236084  ginger garlic masala\n",
      "25   http://www.wikidata.org/entity/Q38029086                chrain\n",
      "26   http://www.wikidata.org/entity/Q52148739                 salça\n",
      "27   http://www.wikidata.org/entity/Q56408589    Heinz Barbie Pasta\n",
      "28   http://www.wikidata.org/entity/Q57998504    sweet pepper paste\n",
      "29   http://www.wikidata.org/entity/Q63890957                 qizha\n",
      "30   http://www.wikidata.org/entity/Q67201117    yellow curry paste\n",
      "31   http://www.wikidata.org/entity/Q67201118       red curry paste\n",
      "32   http://www.wikidata.org/entity/Q67201120     green curry paste\n",
      "33   http://www.wikidata.org/entity/Q67206116        Massaman Paste\n",
      "34   http://www.wikidata.org/entity/Q67206285  phanaeng curry paste\n",
      "35   http://www.wikidata.org/entity/Q67207722        tamarind paste\n",
      "36   http://www.wikidata.org/entity/Q67892518            crab flesh\n",
      "37   http://www.wikidata.org/entity/Q68435417     horseradish paste\n",
      "38   http://www.wikidata.org/entity/Q68437707          wasabi paste\n",
      "39   http://www.wikidata.org/entity/Q82813109               buticha\n",
      "40  http://www.wikidata.org/entity/Q115607763            bean paste\n",
      "41     http://www.wikidata.org/entity/Q167893            mayonnaise\n",
      "42     http://www.wikidata.org/entity/Q178143               ketchup\n",
      "43      http://www.wikidata.org/entity/Q42527                 spice\n",
      "44     http://www.wikidata.org/entity/Q147651         peanut butter\n",
      "45     http://www.wikidata.org/entity/Q165199          chili pepper\n",
      "46     http://www.wikidata.org/entity/Q178024                 dough\n",
      "47     http://www.wikidata.org/entity/Q178359                 sauce\n",
      "48    http://www.wikidata.org/entity/Q1882876                  mace\n",
      "49    http://www.wikidata.org/entity/Q1921878                merkén\n"
     ]
    },
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "/var/folders/nv/nmq2kszs29945hght0_1sjcw0000gn/T/ipykernel_5286/1913620409.py:139: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.\n",
      "  df = df.applymap(lambda x: x[\"value\"])\n"
     ]
    }
   ],
   "source": [
    "named_after = \"wdt:P138\"\n",
    "occupation = \"wdt:P106\"\n",
    "sensible_sister_predicates = f\"wdt:P279 wdt:P361 wdt:P101 wdt:P361 wdt:P921 wdt:P131 wdt:P150 {named_after} {occupation}\"\n",
    "\n",
    "generator = Generator(sister_predicates=sensible_sister_predicates)\n",
    "\n",
    "# Display mustard sister topics\n",
    "results = generator.sister_topic(\"mustard\", n_items=100)\n",
    "generator.display_as_table(results, 50)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 50,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "On what topic do you want questions?\n",
      "How many questions do you want?\n",
      "http://www.wikidata.org/entity/Q131748\n",
      "http://www.wikidata.org/entity/P31\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "{'head': {'vars': ['thing']},\n",
       " 'results': {'bindings': [{'thing': {'type': 'uri',\n",
       "     'value': 'http://www.wikidata.org/entity/Q2727838'}},\n",
       "   {'thing': {'type': 'uri',\n",
       "     'value': 'http://www.wikidata.org/entity/Q7856511'}},\n",
       "   {'thing': {'type': 'uri',\n",
       "     'value': 'http://www.wikidata.org/entity/Q21427661'}},\n",
       "   {'thing': {'type': 'uri',\n",
       "     'value': 'http://www.wikidata.org/entity/Q60336988'}}]}}"
      ]
     },
     "execution_count": 50,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "print(\"On what topic do you want questions?\")\n",
    "topic = input()\n",
    "print(\"How many questions do you want?\")\n",
    "num_questions = int(input())\n",
    "\n",
    "generator.sparql_question(topic, \"instance of\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Label: Berlin\n",
      "Description: federated state, capital and largest city of Germany\n",
      "Aliases: Berlin, Germany, Berlin (Germany), DE-BE\n"
     ]
    }
   ],
   "source": [
    "\n",
    "def get_wikidata_item(item_id):\n",
    "    # Wikidata API endpoint\n",
    "    url = \"https://www.wikidata.org/w/api.php\"\n",
    "    \n",
    "    # Parameters for the API request\n",
    "    params = {\n",
    "        \"action\": \"wbgetentities\",  # Action to get data about entities\n",
    "        \"ids\": item_id,  # ID of the Wikidata item (e.g., Q64 for Berlin)\n",
    "        \"format\": \"json\",  # Response format\n",
    "        \"props\": \"labels|descriptions|aliases\",  # Properties to retrieve: labels, descriptions, and aliases\n",
    "        \"languages\": \"en\"  # Language filter\n",
    "    }\n",
    "    \n",
    "    # Make the GET request to the Wikidata API\n",
    "    response = requests.get(url, params=params)\n",
    "    \n",
    "    # Check if the request was successful\n",
    "    if response.status_code == 200:\n",
    "        # Parse the JSON response\n",
    "        data = response.json()\n",
    "        \n",
    "        # Access the item's data\n",
    "        item_data = data['entities'][item_id]\n",
    "        \n",
    "        # Extract and print the label, description, and aliases\n",
    "        label = item_data['labels']['en']['value']\n",
    "        description = item_data['descriptions']['en']['value']\n",
    "        aliases = [alias['value'] for alias in item_data['aliases']['en']]\n",
    "        \n",
    "        print(f\"Label: {label}\")\n",
    "        print(f\"Description: {description}\")\n",
    "        print(f\"Aliases: {', '.join(aliases)}\")\n",
    "    else:\n",
    "        print(\"Failed to retrieve data\")\n",
    "\n",
    "# Example usage\n",
    "get_wikidata_item(\"Q64\")"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "krr",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.12.1"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
