{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "/var/folders/g_/12fwrqfs2lgcf9rnql4m440dx849vl/T/ipykernel_13611/3108238445.py:3: DeprecationWarning: \n",
      "Pyarrow will become a required dependency of pandas in the next major release of pandas (pandas 3.0),\n",
      "(to allow more performant data types, such as the Arrow string type, and better interoperability with other libraries)\n",
      "but was not found to be installed on your system.\n",
      "If this would cause problems for you,\n",
      "please provide us feedback at https://github.com/pandas-dev/pandas/issues/54466\n",
      "        \n",
      "  import pandas\n"
     ]
    }
   ],
   "source": [
    "import requests\n",
    "from SPARQLWrapper import SPARQLWrapper, JSON\n",
    "import pandas\n",
    "import question\n",
    "import random"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {},
   "outputs": [],
   "source": [
    "# Predicates\n",
    "SUBCLASS_OF = \"P279\"\n",
    "PART_OF = \"P361\"\n",
    "INSTANCE_OF = \"P31\"\n",
    "\n",
    "predicates = [SUBCLASS_OF, PART_OF, INSTANCE_OF]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {},
   "outputs": [],
   "source": [
    "wikidata_properties = {\n",
    "    \"named_after\": \"wdt:P138\",\n",
    "    \"occupation\": \"wdt:P106\",\n",
    "    \"has_use\": \"wdt:P366\",\n",
    "    \"studied_in\": \"wdt:P2579\",\n",
    "    \"subclass_of\": \"wdt:P279\",\n",
    "    \"part_of\": \"wdt:P361\",\n",
    "    \"field_of_work\": \"wdt:P101\",\n",
    "    \"main_subject\": \"wdt:P921\",\n",
    "    \"located_in_the_administrative_territorial_entity\": \"wdt:P131\",\n",
    "    \"contains_administrative_territorial_entity\": \"wdt:P150\",\n",
    "    \"practiced by\": \"wdt:P3095\"\n",
    "}\n",
    "\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 127,
   "metadata": {},
   "outputs": [],
   "source": [
    "# Category Example: Team Sports\n",
    "# Element Example: Baseball\n",
    "\n",
    "class Generator:\n",
    "    def __init__(self, sister_predicates):\n",
    "        self.sparql = SPARQLWrapper(\"https://query.wikidata.org/sparql\")\n",
    "        self.sister_predicates = sister_predicates\n",
    "    \n",
    "    # SPARQL Helper Methods\n",
    "    def run_query(self, query):\n",
    "        '''\n",
    "        Description:\n",
    "            Takes in query and requests its output\n",
    "        \n",
    "        Arguments:\n",
    "            query:string\n",
    "        \n",
    "        Returns:\n",
    "            results:JSON\n",
    "        '''\n",
    "        # Set the query and the return format (JSON)\n",
    "        self.sparql.setQuery(query)\n",
    "        self.sparql.setReturnFormat(JSON)\n",
    "\n",
    "        # Perform the query and convert the result to a Python dictionary\n",
    "        results = self.sparql.query().convert()\n",
    "        return results \n",
    "    def find_label_by_ID(self, ID):\n",
    "        '''\n",
    "        Description:\n",
    "            Takes in QID and outputs its label\n",
    "        \n",
    "        Arguments:\n",
    "            ID:string - \"QXXXXX\"\n",
    "        \n",
    "        Returns:\n",
    "            label:string\n",
    "        '''\n",
    "        query = f'''\n",
    "        SELECT ?itemLabel WHERE {{\n",
    "            wd:{ID} rdfs:label ?itemLabel.\n",
    "            FILTER(LANG(?itemLabel) = \"en\")\n",
    "        }}\n",
    "        '''\n",
    "        results = self.run_query(query)\n",
    "        return results[\"results\"][\"bindings\"][0][\"itemLabel\"][\"value\"]\n",
    "    def find_uri_by_label(self, label):\n",
    "        '''\n",
    "        Description:\n",
    "            Takes in label and outputs its URI\n",
    "        \n",
    "        Arguments:\n",
    "            label:string\n",
    "        \n",
    "        Returns:\n",
    "            uri:string - 'http://www.wikidata.org/entity/XXXXXXX'\n",
    "        '''\n",
    "        \n",
    "        # Create SPARQL query to find the URI for a given label\n",
    "        query = f'''SELECT ?item WHERE {{ \n",
    "                    ?item rdfs:label \"{label.replace('\"', '\\\"')}\"@en.\n",
    "                    SERVICE wikibase:label {{ bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }} \n",
    "                }} LIMIT 1'''\n",
    "        \n",
    "        try:\n",
    "            results = self.run_query(query)\n",
    "\n",
    "            # The first matching URI\n",
    "            binding = results[\"results\"][\"bindings\"][0]\n",
    "            result = binding[\"item\"][\"value\"]\n",
    "            return result\n",
    "        except Exception as e:\n",
    "            print(f\"An error occurred: {e}\")\n",
    "            return None\n",
    "    def find_ID_by_label(self, label):\n",
    "        '''\n",
    "        Description:\n",
    "            Takes in label and outputs its ID\n",
    "        \n",
    "        Arguments:\n",
    "            label:string\n",
    "        \n",
    "        Returns:\n",
    "            id:string - 'QXXXXXX'\n",
    "        '''\n",
    "        uri = self.find_uri_by_label(label)\n",
    "        id = uri.split(\"/\")[-1]\n",
    "        return id\n",
    "    def find_ID_by_uri(self, uri):\n",
    "        '''\n",
    "        Description:\n",
    "            Takes in uri and outputs its ID\n",
    "        \n",
    "        Arguments:\n",
    "            uri:string - http://www.wikidata.org/entity/QXXXXX or http://www.wikidata.org/prop/direct/PXXXXX \n",
    "        \n",
    "        Returns:\n",
    "            id:string - 'Q/PXXXXXX'\n",
    "        '''\n",
    "        return uri.split('/')[-1]\n",
    "    def process_JSON(self, results_JSON, desired_variables):\n",
    "        '''\n",
    "        Description:\n",
    "            Takes in output of a query and returns the desired outputs\n",
    "        \n",
    "        Arguments:\n",
    "            results_JSON:JSON\n",
    "            desired_variables:List(string) - variables wanted from output \n",
    "        \n",
    "        Returns:\n",
    "            results:List(ID)\n",
    "        '''\n",
    "        results = []\n",
    "        for c in results_JSON['results']['bindings']:\n",
    "            r = []\n",
    "            for variable in desired_variables:\n",
    "                r.append(self.find_ID_by_uri(c[variable]['value']))\n",
    "            results.append(r)\n",
    "\n",
    "        return results\n",
    "    def random_items(self, items, count):\n",
    "        '''\n",
    "        Description:\n",
    "            Takes in a list of items and outputs a random subset of them\n",
    "        \n",
    "        Arguments:\n",
    "            items:list\n",
    "            count:int\n",
    "        \n",
    "        Returns:\n",
    "            selected:list() - List of count items\n",
    "        '''\n",
    "        \n",
    "        selected = random.sample(items, count)\n",
    "        return selected\n",
    "    def generate_avoided_element_queries(self, avoided_elementIDs):\n",
    "        '''\n",
    "        Description:\n",
    "            Takes in list of element IDs and outputs a string of SPARQL queries that avoid them\n",
    "        \n",
    "        Arguments:\n",
    "            avoided_elementIDs:list(string)\n",
    "        \n",
    "        Returns:\n",
    "            avoided_element_queries:string\n",
    "        '''\n",
    "        avoided_element_queries = \"\"\n",
    "        for elementID in avoided_elementIDs:\n",
    "            avoided_element_queries += f'wd:{elementID} ?predicates ?category.\\n'\n",
    "        return avoided_element_queries\n",
    "    def sister_category(self, categoryID, avoided_elementIDs, included_elementIDs=[], n_items=3):\n",
    "        '''\n",
    "        Description:\n",
    "            Takes in category and element IDs and outputs related categories that don't contain the element\n",
    "        \n",
    "        Arguments:\n",
    "            categoryID:string\n",
    "            avoided_elementIDs:list(string) - elements the category shouldn't cover\n",
    "            included_elementIDs:list(string) - elements the category should cover - unimplemented\n",
    "            n_items:int\n",
    "        \n",
    "        Returns:\n",
    "            results:List(ID) - IDs of Sister categories of categoryID\n",
    "            preds:List(ID) - IDS of predicates corresponding to results\n",
    "            \n",
    "        '''\n",
    "        # Prepare elements\n",
    "        avoided_element_queries = \"\"\n",
    "        for elementID in avoided_elementIDs:\n",
    "            avoided_element_queries += f'wd:{elementID} ?predicates ?category.\\n'\n",
    "        \n",
    "        # included_element_queries = \"\"\n",
    "        # if len(included_elementIDs) != 0:\n",
    "        #     # included_element_queries += \"VALUES ?includedElements {\"\n",
    "        #     for elementID in included_elementIDs:\n",
    "        #         included_element_queries += f'wd:{elementID} '\n",
    "        #     # included_element_queries += \"}\\n\"\n",
    "        #     # included_element_queries += \"?includedElements ?predicates ?category.\\n\"\n",
    "            \n",
    "\n",
    "\n",
    "        # Make query\n",
    "        desired_variables = [\"category\", \"predicate\"]\n",
    "        query = f'''\n",
    "                SELECT ?category ?categoryLabel ?predicate WHERE {{\n",
    "                    SERVICE wikibase:label {{ bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }}\n",
    "                    VALUES ?predicates {{ {self.sister_predicates} }}\n",
    "                    wd:{categoryID} ?predicates ?superCategory.\n",
    "                    ?category ?predicates ?superCategory.\n",
    "\n",
    "                    #VALUES ?includedElements {{ included_element_queries }}\n",
    "                    #?includedElements ?predicates ?category.\n",
    "\n",
    "                    FILTER(?category != wd:{categoryID})\n",
    "                    FILTER NOT EXISTS {{\n",
    "                        {avoided_element_queries}\n",
    "                    }}\n",
    "                \n",
    "                    ?superCategory rdfs:label ?superCategoryLabel .\n",
    "                    FILTER(LANG(?superCategoryLabel) = \"en\")\n",
    "                    ?category rdfs:label ?categoryLabel .\n",
    "                    FILTER(LANG(?categoryLabel) = \"en\")\n",
    "                    BIND(?predicates AS ?predicate)\n",
    "  \n",
    "                }}\n",
    "                LIMIT {n_items}\n",
    "                #GROUP BY ?category ?categoryLabel\n",
    "                #HAVING (COUNT(?includedElements) = {len(included_elementIDs)})\n",
    "        '''\n",
    "        \n",
    "        results = self.run_query(query)\n",
    "        \n",
    "        results = self.process_JSON(results, desired_variables)\n",
    "        return [r[0] for r in results], [r[1] for r in results]\n",
    "    def sister_element(self, elementID, categoryID, exceptions=[], n_items=100):\n",
    "        '''\n",
    "        Description:\n",
    "            Takes in element's ID and its category's ID and outputs related elements not in said category\n",
    "        \n",
    "        Arguments:\n",
    "            elementID:string - \"QXXXXX\"\n",
    "            categoryID:string - \"QXXXXX\"\n",
    "            exceptions: list \n",
    "            n_items:int\n",
    "        \n",
    "        Returns:\n",
    "            results:List(ID) - IDs of Sister topics of label\n",
    "        '''\n",
    "        \n",
    "        #exeptions = [f'FILTER NOT EXISTS {{?item {exception} .}}\\n' for exception in exceptions]\n",
    "        exception_patterns = []\n",
    "        for exception in exceptions:\n",
    "            predicate, object = exception.split()\n",
    "            pattern = f\"\"\"FILTER NOT EXISTS {{\n",
    "                            ?sisterElement {predicate} ?exceptionCategory .\n",
    "                            ?exceptionCategory (wdt:P279)* {object} .\n",
    "                        }}\\n\"\"\"\n",
    "            exception_patterns.append(pattern)\n",
    "\n",
    "        exceptions_string = \"\".join(exception_patterns)\n",
    "\n",
    "        # Get Sister Catgeories\n",
    "        sister_categories, sister_preds = self.sister_category(categoryID, [elementID], n_items=n_items)\n",
    "        sister_preds = list(set(sister_preds))\n",
    "        # Note: sister_preds[i] represents the predicate used to find sister_categories[i]\n",
    "        '''\n",
    "        Example:\n",
    "        Some superCategory is a category that categoryID is within based on sister_preds[i]\n",
    "        sister_categories[i] is in superCategory based on sister_preds[i]\n",
    "\n",
    "        Thus, to find a sister of elementID (more like cousin), the sister_element must be within sister_categories[i] based on sister_preds[i]\n",
    "\n",
    "        So, let's say the category is team sports.. Team sports is a SUBCLASS_OF sports.\n",
    "        Animal sports is a SUBCLASS_OF sports\n",
    "        Horse racing is a SUBCLASS_OF animal sports\n",
    "\n",
    "        In that example:\n",
    "        categoryID = team sports\n",
    "        superCategory = sports\n",
    "        sister_category[i] = animal sports\n",
    "        sister_preds[i] = SUBCLASS_OF\n",
    "        sister of elementID = horse racing\n",
    "\n",
    "        Using sister_preds ensures that the sister_elements generated are closer to elementID\n",
    "        '''\n",
    "\n",
    "        #SPARQL query to find elements that are similar to the elementID but not in categoryID\n",
    "        desired_variables = [\"sisterElement\"]\n",
    "        query = f'''\n",
    "        SELECT ?sisterElement ?sisterElementLabel WHERE {{\n",
    "            VALUES ?predicates {{ {\"\".join([f'wdt:{p} ' for p in sister_preds])} }}\n",
    "            VALUES ?sisterCategories {{ {\"\".join([f\"wd:{sister} \" for sister in sister_categories])} }}\n",
    "            \n",
    "            SERVICE wikibase:label {{ bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }}\n",
    "            ?sisterElement ?predicates ?sisterCategories.\n",
    "            ?sisterElement rdfs:label ?sisterElementLabel.\n",
    "\n",
    "            FILTER(LANG(?sisterElementLabel) = \"en\")\n",
    "            FILTER(?sisterElement != wd:{elementID})\n",
    "            {exceptions_string}\n",
    "            \n",
    "        }}\n",
    "        \n",
    "        LIMIT {n_items}\n",
    "        '''\n",
    "        \n",
    "        results = self.run_query(query)\n",
    "        results = self.process_JSON(results, desired_variables)\n",
    "\n",
    "        return [r[0] for r in results]\n",
    "        \n",
    "    \n",
    "    # Printing Methods\n",
    "    def display_as_table(self, results, n_items):\n",
    "        '''\n",
    "        Description:\n",
    "            Creates a table of the n_items of the queried results\n",
    "        \n",
    "        Arguments:\n",
    "            results:JSON - sister topics\n",
    "            n_items:int\n",
    "        \n",
    "        Returns:\n",
    "            None\n",
    "        '''\n",
    "        df = pandas.DataFrame.from_dict(results[\"results\"][\"bindings\"][:n_items])\n",
    "        df = df.applymap(lambda x: x[\"value\"])\n",
    "        pandas.set_option('display.max_rows', n_items) # n_items doesnt work here\n",
    "        print(df)\n",
    "    def print_question(self, question):\n",
    "        '''\n",
    "        Description:\n",
    "            Prints the question\n",
    "        \n",
    "        Arguments:\n",
    "            question:Question\n",
    "        \n",
    "        Returns:\n",
    "            None\n",
    "        '''\n",
    "        print(f\"Which of the following is a {question.relation.predicate} {question.relation.object}?\")\n",
    "       \n",
    "        print(question.all_answers)\n",
    "        for index, answer in enumerate(question.all_answers):\n",
    "            print(f\"{index + 1}. {self.find_label_by_ID(answer)}\")\n",
    "   \n",
    "    # Element-> Category+Elements Question Methods\n",
    "    '''\n",
    "    Which of the following is a subclass of Olympic sport?\n",
    "    1. savika\n",
    "    2. *baseball*\n",
    "    3. memory sport\n",
    "    4. snowshoe biathlon\n",
    "    '''\n",
    "    def get_category_relation(self, label):\n",
    "        '''\n",
    "        Description:\n",
    "            Takes in label and outputs one of its categories in the form of a relation\n",
    "            Relations are pairs of predicates and objects\n",
    "\n",
    "        Arguments:\n",
    "            label:string\n",
    "        \n",
    "        Returns:\n",
    "            Relation object\n",
    "        '''\n",
    "        topicID = self.find_ID_by_label(label)\n",
    "        # Randomly choose a ?predicate ?object pair\n",
    "        desired_variables = [\"predicate\", \"object\"]\n",
    "        query = f'''\n",
    "        SELECT ?predicate ?object WHERE {{\n",
    "            VALUES ?predicate {{ {self.sister_predicates} }}\n",
    "            \n",
    "            ?object rdfs:label ?label.\n",
    "            wd:{topicID} ?predicate ?object.\n",
    "            SERVICE wikibase:label {{ bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }}\n",
    "        }}\n",
    "        '''\n",
    "        results = self.process_JSON(self.run_query(query), desired_variables)\n",
    "        random_relation = self.random_items(results, count=1)[0]\n",
    "\n",
    "        return question.Relation(random_relation[0], random_relation[1])\n",
    "    def check_answer_is_correct_pattern_r(self, possible_answer, relation):\n",
    "        return self.check_answer_is_correct_pattern(possible_answer, \"wdt:\" + relation.predicate, \"wd:\" + relation.object)\n",
    "    def check_answer_is_correct_pattern(self, possible_answer, predicate, object):\n",
    "        '''\n",
    "        Description:\n",
    "            Takes in possible answer and relation and generates a pattern to check if the answer is correct\n",
    "            \n",
    "        Arguments:\n",
    "            possible_answer:string\n",
    "            relation:Relation\n",
    "            If variable ?v. If QID wd:QID. I can't append wd to things arbitrarily because I want this to handle variables or QIDs\n",
    "            Similar for predicates and objects\n",
    "        Returns:\n",
    "            string - SPARQL query pattern\n",
    "        '''\n",
    "        \n",
    "\n",
    "        predicate_then_subclassstar = f\"\"\"{possible_answer} {predicate} ?exceptionCategory .\n",
    "                                            ?exceptionCategory (wdt:P279)* {object} .\"\"\"\n",
    "        # predicate is occupation. Check if possible_answer has a field of work practiced by object\n",
    "        \n",
    "        field_of_work_occupation = f\"\"\"#check if predicate is occupation\n",
    "                                    FILTER({predicate} = {wikidata_properties['occupation']})\n",
    "                                    {possible_answer} {wikidata_properties['field_of_work']} ?field .\n",
    "                                    ?field {wikidata_properties[\"practiced by\"]} {object} .\"\"\"\n",
    "        # Append the patterns to a list\n",
    "        patterns = [predicate_then_subclassstar, field_of_work_occupation]\n",
    "        # UNION the patterns together\n",
    "        # put curly braces around the patterns\n",
    "        patterns = [f\"{{{pattern}}}\" for pattern in patterns]\n",
    "        # join the patterns with a newline and a UNION\n",
    "        patterns = \"\\nUNION\\n\".join(patterns)\n",
    "        return patterns\n",
    "    def check_answer_using_pattern(self, possible_answer, relation):\n",
    "        '''\n",
    "        Description:\n",
    "            Takes in possible answer and relation and checks if the answer is correct\n",
    "        \n",
    "        Arguments:\n",
    "            possible_answer:string\n",
    "            relation:Relation\n",
    "        \n",
    "        Returns:\n",
    "            boolean\n",
    "        '''\n",
    "        patterns = self.check_answer_is_correct_pattern_r(\"wd:\" + possible_answer, relation)\n",
    "        query = f'''\n",
    "        ASK WHERE {{\n",
    "            {patterns}\n",
    "        }}\n",
    "        '''\n",
    "        print(query)\n",
    "        results = self.run_query(query)\n",
    "        return results['boolean']\n",
    "    \n",
    "    def element_question_unified(self, QID, num_wrong_answers=3, num_questions=1):\n",
    "        '''\n",
    "        Description:\n",
    "            Creates a question with the element as the correct answer\n",
    "            Unlike element_question, it uses only one SPARQL query to find the relation and sister elements\n",
    "        Arguments:\n",
    "            element_label:string\n",
    "            num_wrong_answers:int\n",
    "        \n",
    "        Returns:\n",
    "            List of question:Question\n",
    "        '''\n",
    "        wrong_answer_variables = [\"?wrong\" + str(i) for i in range(num_wrong_answers)]\n",
    "        wrong_answer_variables_str = \" \".join(wrong_answer_variables)\n",
    "        wrong_answer_filters = \"\\n\".join([f\"FILTER NOT EXISTS {{\\n{self.check_answer_is_correct_pattern(wrong_answer_variable, \"?predicate\", \"?object\")}\\n}}\" for wrong_answer_variable in wrong_answer_variables])\n",
    "        # Make sure wrong answers are unique. Requires n^2 queries\n",
    "        wrong_uniqueness_filters = \"\\n\".join([f\"FILTER(?wrong{i} != ?wrong{j})\" for i in range(num_wrong_answers) for j in range(i+1, num_wrong_answers)])\n",
    "        wrong_answers_share_predicate = \"\\n\".join([self.check_answer_is_correct_pattern(wrong_answer_variable, \"?sister_predicate\", \"?object\") for wrong_answer_variable in wrong_answer_variables])\n",
    "        \n",
    "        query = f'''\n",
    "        SELECT DISTINCT ?predicate ?object {wrong_answer_variables_str} WHERE {{\n",
    "            VALUES ?predicate {{ {self.sister_predicates} }}\n",
    "            VALUES ?sister_predicate {{ {self.sister_predicates} }}\n",
    "            #FILTER(?predicate != ?sister_predicate) # Could make this more complicated so that each wrong answer can have its own sister_predicate\n",
    "            {self.check_answer_is_correct_pattern(\"wd:\" + QID, \"?predicate\", \"?object\")}\n",
    "            wd:{QID} ?sister_predicate ?object.\n",
    "            #SERVICE wikibase:label {{ bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }}\n",
    "            #FILTER(LANG(?object) = \"en\")\n",
    "            FILTER(?object != wd:{QID})\n",
    "            ?object rdfs:label ?label. # make sure the object has a label\n",
    "            {wrong_answer_filters}\n",
    "            {wrong_uniqueness_filters}\n",
    "            {wrong_answers_share_predicate}\n",
    "        }}\n",
    "        LIMIT {num_questions}\n",
    "        '''\n",
    "        print(query)\n",
    "        results = self.run_query(query)\n",
    "        results = self.process_JSON(results, [\"predicate\", \"object\"] + wrong_answer_variables)\n",
    "        questions = []\n",
    "        for result in results:\n",
    "            relation = question.Relation(result[0], result[1])\n",
    "            wrong_answers = result[2:]\n",
    "            questions.append(question.Question(relation, QID, wrong_answers))\n",
    "        return questions\n",
    "        \n",
    "    def element_question(self, element_label, num_wrong_answers=3):\n",
    "        '''\n",
    "        Description:\n",
    "           Creates a question with the element as the correct answer\n",
    "        \n",
    "        Arguments:\n",
    "            element_label:string\n",
    "            num_wrong_answers:int\n",
    "        \n",
    "        Returns:\n",
    "            question:Question\n",
    "        '''\n",
    "        elementID = self.find_ID_by_label(element_label)\n",
    "        \n",
    "        relation = self.get_category_relation(element_label)\n",
    "        categoryID = relation.object\n",
    "        wrong_answers = self.sister_element(elementID, categoryID, [str(relation)])\n",
    "\n",
    "        selected_answers = self.random_items(wrong_answers, count=num_wrong_answers)\n",
    "        relation = question.Relation( self.find_label_by_ID(relation.predicate), self.find_label_by_ID(relation.object))\n",
    "        return question.Question(relation, elementID, selected_answers)\n",
    "    \n",
    "    # Element(s) -> Categories Question Methods\n",
    "    '''\n",
    "    Which of the following is a category baseball, volleyball, basketball, and cricket all belong to?\n",
    "    1. sport in ancient Greece\n",
    "    2. *team sport*\n",
    "    3. racing sports\n",
    "    4. sport in Europe\n",
    "    '''\n",
    "    def find_category(self, elementIDs, predicateID=SUBCLASS_OF):\n",
    "        '''\n",
    "        Description:\n",
    "            Inputs element IDs and outputs a category ID that they all belong to based on the predicate\n",
    "        \n",
    "        Arguments:\n",
    "            elementIDs:list(string)\n",
    "            predicateID:string\n",
    "        \n",
    "        Returns:\n",
    "            random_categoryID:string -  random category that elementID belongs to\n",
    "        '''\n",
    "        # Prepare elements\n",
    "        element_queries = \"\".join([f\"wd:{e} \" for e in elementIDs]) # wd:QXXXX for every element\n",
    "        \n",
    "        # Prepare query\n",
    "        desired_variables = [\"category\"]\n",
    "        query = f'''\n",
    "        SELECT ?category ?label (COUNT(?elements) as ?elementCount) WHERE {{\n",
    "            VALUES ?elements {{ {element_queries} }}\n",
    "            ?elements wdt:{predicateID} ?category.\n",
    "            ?category rdfs:label ?label.\n",
    "\n",
    "            SERVICE wikibase:label {{ bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }}\n",
    "            FILTER(LANG(?label) = \"en\")\n",
    "        }}\n",
    "        GROUP BY ?category ?label\n",
    "        HAVING (COUNT(?elements) = {len(elementIDs)})\n",
    "        '''\n",
    "           \n",
    "        categories = self.process_JSON(self.run_query(query), desired_variables)\n",
    "        if len(categories) == 0:\n",
    "            print(query)\n",
    "            raise Exception(\"These elements do not have a shared category\")\n",
    "        categories = [c[0] for c in categories]\n",
    "        random_categoryID = self.random_items(categories, count=1)[0]\n",
    "        \n",
    "        return random_categoryID\n",
    "    def category_question(self, element_labels, num_wrong_answers=3):\n",
    "        '''\n",
    "        Description:\n",
    "            Inputs elements and outputs 4 categories, one being the one that contains every element\n",
    "        \n",
    "        Arguments:\n",
    "            element_labels:list(string)\n",
    "            num_wrong_answers:int\n",
    "        \n",
    "        Returns:\n",
    "            question:Question\n",
    "        '''\n",
    "        # Get category of the elements\n",
    "        elementIDs = []\n",
    "        for element_label in element_labels:\n",
    "            elementIDs.append(self.find_ID_by_label(element_label))\n",
    "        categoryID = self.find_category(elementIDs) # Default is SUBCLASS_OF\n",
    "        \n",
    "        # Get 3 other sister categories that are similar, but not the correct answer\n",
    "        print(elementIDs)\n",
    "        results, _ = self.sister_category(categoryID, elementIDs, n_items=num_wrong_answers) \n",
    "\n",
    "        # Prepare object of relation\n",
    "        object = \"\"\n",
    "        i=0\n",
    "        while i < len(element_labels) - 1:\n",
    "            object += f\"{element_labels[i]}, \"\n",
    "            i+=1\n",
    "        \n",
    "        if len(element_labels) == 1:\n",
    "            object += f\"{element_labels[i]} belongs to\"\n",
    "        else:\n",
    "            object += f\"and {element_labels[i]} all belong to\"\n",
    "\n",
    "        # Return the 3 sisters and the correct category\n",
    "        relation = question.Relation(\"category\", object)\n",
    "        \n",
    "        return question.Question(relation, categoryID, results)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 123,
   "metadata": {},
   "outputs": [],
   "source": [
    "# print(\"What element do you want the correct answer to the question to be?\", end=\": \")\n",
    "# element = input()\n",
    "# print(element)\n",
    "# print(\"How many questions do you want?\", end=\": \")\n",
    "# num_questions = int(input())\n",
    "# print(num_questions)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 132,
   "metadata": {},
   "outputs": [],
   "source": [
    "named_after = \"wdt:P138\"\n",
    "occupation = \"wdt:P106\"\n",
    "has_use = \"wdt:P366\"\n",
    "studied_in = \"wdt:P2579\"\n",
    "\n",
    "sensible_sister_predicates = f\"wdt:P279 wdt:P101 wdt:P361 wdt:P921 wdt:P131 wdt:P150 {named_after} {occupation} {has_use} {studied_in}\"\n",
    "\n",
    "generator = Generator(sister_predicates=sensible_sister_predicates)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 125,
   "metadata": {},
   "outputs": [],
   "source": [
    "import time\n",
    "def question_answer(question):\n",
    "    generator.print_question(question)\n",
    "    time.sleep(0.2)\n",
    "\n",
    "    answer = int(input(\"What is your answer?\")) - 1\n",
    "    user_answer = generator.find_label_by_ID(question.all_answers[answer])\n",
    "    print(f\"Your answer was {user_answer}\")\n",
    "    correct_answer = generator.find_label_by_ID(question.correct_answer)\n",
    "    print(f\"The correct answer was {correct_answer}\")\n",
    "    if user_answer == correct_answer:\n",
    "        print(\"You are correct!\")\n",
    "    else:\n",
    "        print(\"You are incorrect!\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 114,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "['Q5369', 'Q1734', 'Q5372', 'Q5375']\n",
      "Which of the following is a category baseball, volleyball, basketball, and cricket all belong to?\n",
      "['Q2847625', 'Q2755547', 'Q2707241', 'Q216048']\n",
      "1. agility sport\n",
      "2. individual sport\n",
      "3. sport in Dordrecht\n",
      "4. team sport\n"
     ]
    },
    {
     "ename": "ValueError",
     "evalue": "invalid literal for int() with base 10: ''",
     "output_type": "error",
     "traceback": [
      "\u001b[0;31m---------------------------------------------------------------------------\u001b[0m",
      "\u001b[0;31mValueError\u001b[0m                                Traceback (most recent call last)",
      "Cell \u001b[0;32mIn[114], line 2\u001b[0m\n\u001b[1;32m      1\u001b[0m cat_q \u001b[38;5;241m=\u001b[39m generator\u001b[38;5;241m.\u001b[39mcategory_question([\u001b[38;5;124m\"\u001b[39m\u001b[38;5;124mbaseball\u001b[39m\u001b[38;5;124m\"\u001b[39m, \u001b[38;5;124m\"\u001b[39m\u001b[38;5;124mvolleyball\u001b[39m\u001b[38;5;124m\"\u001b[39m, \u001b[38;5;124m\"\u001b[39m\u001b[38;5;124mbasketball\u001b[39m\u001b[38;5;124m\"\u001b[39m, \u001b[38;5;124m\"\u001b[39m\u001b[38;5;124mcricket\u001b[39m\u001b[38;5;124m\"\u001b[39m])\n\u001b[0;32m----> 2\u001b[0m \u001b[43mquestion_answer\u001b[49m\u001b[43m(\u001b[49m\u001b[43mcat_q\u001b[49m\u001b[43m)\u001b[49m\n",
      "Cell \u001b[0;32mIn[113], line 6\u001b[0m, in \u001b[0;36mquestion_answer\u001b[0;34m(question)\u001b[0m\n\u001b[1;32m      3\u001b[0m generator\u001b[38;5;241m.\u001b[39mprint_question(question)\n\u001b[1;32m      4\u001b[0m time\u001b[38;5;241m.\u001b[39msleep(\u001b[38;5;241m0.2\u001b[39m)\n\u001b[0;32m----> 6\u001b[0m answer \u001b[38;5;241m=\u001b[39m \u001b[38;5;28;43mint\u001b[39;49m\u001b[43m(\u001b[49m\u001b[38;5;28;43minput\u001b[39;49m\u001b[43m(\u001b[49m\u001b[38;5;124;43m\"\u001b[39;49m\u001b[38;5;124;43mWhat is your answer?\u001b[39;49m\u001b[38;5;124;43m\"\u001b[39;49m\u001b[43m)\u001b[49m\u001b[43m)\u001b[49m \u001b[38;5;241m-\u001b[39m \u001b[38;5;241m1\u001b[39m\n\u001b[1;32m      7\u001b[0m user_answer \u001b[38;5;241m=\u001b[39m generator\u001b[38;5;241m.\u001b[39mfind_label_by_ID(question\u001b[38;5;241m.\u001b[39mall_answers[answer])\n\u001b[1;32m      8\u001b[0m \u001b[38;5;28mprint\u001b[39m(\u001b[38;5;124mf\u001b[39m\u001b[38;5;124m\"\u001b[39m\u001b[38;5;124mYour answer was \u001b[39m\u001b[38;5;132;01m{\u001b[39;00muser_answer\u001b[38;5;132;01m}\u001b[39;00m\u001b[38;5;124m\"\u001b[39m)\n",
      "\u001b[0;31mValueError\u001b[0m: invalid literal for int() with base 10: ''"
     ]
    }
   ],
   "source": [
    "cat_q = generator.category_question([\"baseball\", \"volleyball\", \"basketball\", \"cricket\"])\n",
    "question_answer(cat_q)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 97,
   "metadata": {},
   "outputs": [],
   "source": [
    "testLabel = \"baseball\"\n",
    "testQID = generator.find_ID_by_label(testLabel)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 82,
   "metadata": {},
   "outputs": [],
   "source": [
    "check_answer_using_pattern = generator.check_answer_using_pattern"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 85,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "wdt:P106 wd:Q82955\n"
     ]
    }
   ],
   "source": [
    "politician = \"Q82955\"\n",
    "occupation = \"P106\"\n",
    "does_politics_relation = question.Relation(occupation, politician)\n",
    "print(str(does_politics_relation))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 134,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "        ASK WHERE {\n",
      "            {wd:Q2042 wdt:P106 ?exceptionCategory .\n",
      "                                            ?exceptionCategory (wdt:P279)* wd:Q82955 .}\n",
      "UNION\n",
      "{#check if predicate is occupation\n",
      "                                    FILTER(wdt:P106 = wdt:P106)\n",
      "                                    wd:Q2042 wdt:P101 ?field .\n",
      "                                    ?field wdt:P3095 wd:Q82955 .}\n",
      "        }\n",
      "        \n",
      "True\n"
     ]
    }
   ],
   "source": [
    "charles_de_gaulle = \"Q2042\"\n",
    "cdg_politics = generator.check_answer_using_pattern(charles_de_gaulle, does_politics_relation)\n",
    "print(cdg_politics)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 138,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "        SELECT ?predicate ?object  WHERE {\n",
      "            VALUES ?predicate { wdt:P279 wdt:P101 wdt:P361 wdt:P921 wdt:P131 wdt:P150 wdt:P138 wdt:P106 wdt:P366 wdt:P2579 }\n",
      "            VALUES ?sister_predicate { wdt:P279 wdt:P101 wdt:P361 wdt:P921 wdt:P131 wdt:P150 wdt:P138 wdt:P106 wdt:P366 wdt:P2579 }\n",
      "            #FILTER(?predicate != ?sister_predicate) # Could make this more complicated so that each wrong answer can have its own sister_predicate\n",
      "            {wd:Q5369 ?predicate ?exceptionCategory .\n",
      "                                            ?exceptionCategory (wdt:P279)* ?object .}\n",
      "UNION\n",
      "{#check if predicate is occupation\n",
      "                                    FILTER(?predicate = wdt:P106)\n",
      "                                    wd:Q5369 wdt:P101 ?field .\n",
      "                                    ?field wdt:P3095 ?object .}\n",
      "            wd:Q5369 ?sister_predicate ?object.\n",
      "            #SERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n",
      "            #FILTER(LANG(?object) = \"en\")\n",
      "            FILTER(?object != wd:Q5369)\n",
      "            ?object rdfs:label ?label. # make sure the object has a label\n",
      "            \n",
      "            \n",
      "            \n",
      "        }\n",
      "        LIMIT 10\n",
      "        \n",
      "P279 Q212434 Q5369 []\n",
      "P279 Q212434 Q5369 []\n",
      "P279 Q212434 Q5369 []\n",
      "P279 Q212434 Q5369 []\n",
      "P279 Q212434 Q5369 []\n",
      "P279 Q212434 Q5369 []\n",
      "P279 Q212434 Q5369 []\n",
      "P279 Q212434 Q5369 []\n",
      "P279 Q212434 Q5369 []\n",
      "P279 Q212434 Q5369 []\n"
     ]
    }
   ],
   "source": [
    "\n",
    "my_question = generator.element_question_unified(testQID, 0, 10)\n",
    "print(\"\\n\".join([str(q) for q in my_question]))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 130,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "<question.Relation at 0x137cfae70>"
      ]
     },
     "execution_count": 130,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "my_question.relation"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Which of the following is a subclass of Olympic sport?\n",
      "['Q5369', 'Q106500', 'Q2739351', 'Q21493761']\n",
      "1. baseball\n",
      "2. sambo\n",
      "3. Yoseikan Budo\n",
      "4. Naginata\n"
     ]
    },
    {
     "ename": "KeyboardInterrupt",
     "evalue": "Interrupted by user",
     "output_type": "error",
     "traceback": [
      "\u001b[0;31m---------------------------------------------------------------------------\u001b[0m",
      "\u001b[0;31mKeyboardInterrupt\u001b[0m                         Traceback (most recent call last)",
      "Cell \u001b[0;32mIn[14], line 2\u001b[0m\n\u001b[1;32m      1\u001b[0m my_question \u001b[38;5;241m=\u001b[39m generator\u001b[38;5;241m.\u001b[39melement_question(\u001b[38;5;124m\"\u001b[39m\u001b[38;5;124mbaseball\u001b[39m\u001b[38;5;124m\"\u001b[39m, \u001b[38;5;241m3\u001b[39m)\n\u001b[0;32m----> 2\u001b[0m \u001b[43mquestion_answer\u001b[49m\u001b[43m(\u001b[49m\u001b[43mmy_question\u001b[49m\u001b[43m)\u001b[49m\n",
      "Cell \u001b[0;32mIn[13], line 6\u001b[0m, in \u001b[0;36mquestion_answer\u001b[0;34m(question)\u001b[0m\n\u001b[1;32m      3\u001b[0m generator\u001b[38;5;241m.\u001b[39mprint_question(question)\n\u001b[1;32m      4\u001b[0m time\u001b[38;5;241m.\u001b[39msleep(\u001b[38;5;241m0.2\u001b[39m)\n\u001b[0;32m----> 6\u001b[0m answer \u001b[38;5;241m=\u001b[39m \u001b[38;5;28mint\u001b[39m(\u001b[38;5;28;43minput\u001b[39;49m\u001b[43m(\u001b[49m\u001b[38;5;124;43m\"\u001b[39;49m\u001b[38;5;124;43mWhat is your answer?\u001b[39;49m\u001b[38;5;124;43m\"\u001b[39;49m\u001b[43m)\u001b[49m) \u001b[38;5;241m-\u001b[39m \u001b[38;5;241m1\u001b[39m\n\u001b[1;32m      7\u001b[0m user_answer \u001b[38;5;241m=\u001b[39m generator\u001b[38;5;241m.\u001b[39mfind_label_by_ID(question\u001b[38;5;241m.\u001b[39mall_answers[answer])\n\u001b[1;32m      8\u001b[0m \u001b[38;5;28mprint\u001b[39m(\u001b[38;5;124mf\u001b[39m\u001b[38;5;124m\"\u001b[39m\u001b[38;5;124mYour answer was \u001b[39m\u001b[38;5;132;01m{\u001b[39;00muser_answer\u001b[38;5;132;01m}\u001b[39;00m\u001b[38;5;124m\"\u001b[39m)\n",
      "File \u001b[0;32m~/opt/anaconda3/envs/krr/lib/python3.12/site-packages/ipykernel/kernelbase.py:1270\u001b[0m, in \u001b[0;36mKernel.raw_input\u001b[0;34m(self, prompt)\u001b[0m\n\u001b[1;32m   1268\u001b[0m     msg \u001b[38;5;241m=\u001b[39m \u001b[38;5;124m\"\u001b[39m\u001b[38;5;124mraw_input was called, but this frontend does not support input requests.\u001b[39m\u001b[38;5;124m\"\u001b[39m\n\u001b[1;32m   1269\u001b[0m     \u001b[38;5;28;01mraise\u001b[39;00m StdinNotImplementedError(msg)\n\u001b[0;32m-> 1270\u001b[0m \u001b[38;5;28;01mreturn\u001b[39;00m \u001b[38;5;28;43mself\u001b[39;49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43m_input_request\u001b[49m\u001b[43m(\u001b[49m\n\u001b[1;32m   1271\u001b[0m \u001b[43m    \u001b[49m\u001b[38;5;28;43mstr\u001b[39;49m\u001b[43m(\u001b[49m\u001b[43mprompt\u001b[49m\u001b[43m)\u001b[49m\u001b[43m,\u001b[49m\n\u001b[1;32m   1272\u001b[0m \u001b[43m    \u001b[49m\u001b[38;5;28;43mself\u001b[39;49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43m_parent_ident\u001b[49m\u001b[43m[\u001b[49m\u001b[38;5;124;43m\"\u001b[39;49m\u001b[38;5;124;43mshell\u001b[39;49m\u001b[38;5;124;43m\"\u001b[39;49m\u001b[43m]\u001b[49m\u001b[43m,\u001b[49m\n\u001b[1;32m   1273\u001b[0m \u001b[43m    \u001b[49m\u001b[38;5;28;43mself\u001b[39;49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43mget_parent\u001b[49m\u001b[43m(\u001b[49m\u001b[38;5;124;43m\"\u001b[39;49m\u001b[38;5;124;43mshell\u001b[39;49m\u001b[38;5;124;43m\"\u001b[39;49m\u001b[43m)\u001b[49m\u001b[43m,\u001b[49m\n\u001b[1;32m   1274\u001b[0m \u001b[43m    \u001b[49m\u001b[43mpassword\u001b[49m\u001b[38;5;241;43m=\u001b[39;49m\u001b[38;5;28;43;01mFalse\u001b[39;49;00m\u001b[43m,\u001b[49m\n\u001b[1;32m   1275\u001b[0m \u001b[43m\u001b[49m\u001b[43m)\u001b[49m\n",
      "File \u001b[0;32m~/opt/anaconda3/envs/krr/lib/python3.12/site-packages/ipykernel/kernelbase.py:1313\u001b[0m, in \u001b[0;36mKernel._input_request\u001b[0;34m(self, prompt, ident, parent, password)\u001b[0m\n\u001b[1;32m   1310\u001b[0m \u001b[38;5;28;01mexcept\u001b[39;00m \u001b[38;5;167;01mKeyboardInterrupt\u001b[39;00m:\n\u001b[1;32m   1311\u001b[0m     \u001b[38;5;66;03m# re-raise KeyboardInterrupt, to truncate traceback\u001b[39;00m\n\u001b[1;32m   1312\u001b[0m     msg \u001b[38;5;241m=\u001b[39m \u001b[38;5;124m\"\u001b[39m\u001b[38;5;124mInterrupted by user\u001b[39m\u001b[38;5;124m\"\u001b[39m\n\u001b[0;32m-> 1313\u001b[0m     \u001b[38;5;28;01mraise\u001b[39;00m \u001b[38;5;167;01mKeyboardInterrupt\u001b[39;00m(msg) \u001b[38;5;28;01mfrom\u001b[39;00m \u001b[38;5;28;01mNone\u001b[39;00m\n\u001b[1;32m   1314\u001b[0m \u001b[38;5;28;01mexcept\u001b[39;00m \u001b[38;5;167;01mException\u001b[39;00m:\n\u001b[1;32m   1315\u001b[0m     \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39mlog\u001b[38;5;241m.\u001b[39mwarning(\u001b[38;5;124m\"\u001b[39m\u001b[38;5;124mInvalid Message:\u001b[39m\u001b[38;5;124m\"\u001b[39m, exc_info\u001b[38;5;241m=\u001b[39m\u001b[38;5;28;01mTrue\u001b[39;00m)\n",
      "\u001b[0;31mKeyboardInterrupt\u001b[0m: Interrupted by user"
     ]
    }
   ],
   "source": [
    "my_question = generator.element_question(\"baseball\", 3)\n",
    "question_answer(my_question)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "\n",
    "def get_wikidata_item(item_id):\n",
    "    # Wikidata API endpoint\n",
    "    url = \"https://www.wikidata.org/w/api.php\"\n",
    "    \n",
    "    # Parameters for the API request\n",
    "    params = {\n",
    "        \"action\": \"wbgetentities\",  # Action to get data about entities\n",
    "        \"ids\": item_id,  # ID of the Wikidata item (e.g., Q64 for Berlin)\n",
    "        \"format\": \"json\",  # Response format\n",
    "        \"props\": \"labels|descriptions|aliases\",  # Properties to retrieve: labels, descriptions, and aliases\n",
    "        \"languages\": \"en\"  # Language filter\n",
    "    }\n",
    "    \n",
    "    # Make the GET request to the Wikidata API\n",
    "    response = requests.get(url, params=params)\n",
    "    \n",
    "    # Check if the request was successful\n",
    "    if response.status_code == 200:\n",
    "        # Parse the JSON response\n",
    "        data = response.json()\n",
    "        \n",
    "        # Access the item's data\n",
    "        item_data = data['entities'][item_id]\n",
    "        \n",
    "        # Extract and print the label, description, and aliases\n",
    "        label = item_data['labels']['en']['value']\n",
    "        description = item_data['descriptions']['en']['value']\n",
    "        aliases = [alias['value'] for alias in item_data['aliases']['en']]\n",
    "        \n",
    "        print(f\"Label: {label}\")\n",
    "        print(f\"Description: {description}\")\n",
    "        print(f\"Aliases: {', '.join(aliases)}\")\n",
    "    else:\n",
    "        print(\"Failed to retrieve data\")\n",
    "\n",
    "# Example usage\n",
    "get_wikidata_item(\"Q64\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "krr",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.12.1"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
