{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "/var/folders/g_/12fwrqfs2lgcf9rnql4m440dx849vl/T/ipykernel_22167/413711305.py:3: DeprecationWarning: \n",
      "Pyarrow will become a required dependency of pandas in the next major release of pandas (pandas 3.0),\n",
      "(to allow more performant data types, such as the Arrow string type, and better interoperability with other libraries)\n",
      "but was not found to be installed on your system.\n",
      "If this would cause problems for you,\n",
      "please provide us feedback at https://github.com/pandas-dev/pandas/issues/54466\n",
      "        \n",
      "  import pandas\n"
     ]
    }
   ],
   "source": [
    "import requests\n",
    "from SPARQLWrapper import SPARQLWrapper, JSON\n",
    "import pandas\n",
    "import question\n",
    "import random\n",
    "import time\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {},
   "outputs": [],
   "source": [
    "# Predicates\n",
    "SUBCLASS_OF = \"P279\"\n",
    "PART_OF = \"P361\"\n",
    "INSTANCE_OF = \"P31\"\n",
    "\n",
    "predicates = [SUBCLASS_OF, PART_OF, INSTANCE_OF]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {},
   "outputs": [],
   "source": [
    "wikidata_properties = {\n",
    "    \"named_after\": \"wdt:P138\",\n",
    "    \"occupation\": \"wdt:P106\",\n",
    "    \"has_use\": \"wdt:P366\",\n",
    "    \"studied_in\": \"wdt:P2579\",\n",
    "    \"subclass_of\": \"wdt:P279\",\n",
    "    \"part_of\": \"wdt:P361\",\n",
    "    \"field_of_work\": \"wdt:P101\",\n",
    "    \"main_subject\": \"wdt:P921\",\n",
    "    \"located_in_the_administrative_territorial_entity\": \"wdt:P131\",\n",
    "    \"contains_administrative_territorial_entity\": \"wdt:P150\",\n",
    "    \"practiced by\": \"wdt:P3095\"\n",
    "}\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 86,
   "metadata": {},
   "outputs": [],
   "source": [
    "# Category Example: Team Sports\n",
    "# Element Example: Baseball\n",
    "from disambiguate import Disambiguate\n",
    "\n",
    "\n",
    "class Generator:\n",
    "    def __init__(self, sister_predicates):\n",
    "        self.sparql = SPARQLWrapper(\"https://query.wikidata.org/sparql\")\n",
    "        self.sister_predicates = sister_predicates\n",
    "        self.check_answer_is_correct_pattern_num_runs = 0\n",
    "        self.disambiguater = Disambiguate()\n",
    "    # SPARQL Helper Methods\n",
    "    def run_query(self, query):\n",
    "        '''\n",
    "        Description:\n",
    "            Takes in query and requests its output\n",
    "        \n",
    "        Arguments:\n",
    "            query:string\n",
    "        \n",
    "        Returns:\n",
    "            results:JSON\n",
    "        '''\n",
    "        # Set the query and the return format (JSON)\n",
    "        self.sparql.setQuery(query)\n",
    "        self.sparql.setReturnFormat(JSON)\n",
    "\n",
    "        # Perform the query and convert the result to a Python dictionary\n",
    "        results = self.sparql.query().convert()\n",
    "        return results \n",
    "    def find_label_by_ID(self, ID):\n",
    "        '''\n",
    "        Description:\n",
    "            Takes in QID and outputs its label\n",
    "        \n",
    "        Arguments:\n",
    "            ID:string - \"QXXXXX\"\n",
    "        \n",
    "        Returns:\n",
    "            label:string\n",
    "        '''\n",
    "        query = f'''\n",
    "        SELECT ?itemLabel WHERE {{\n",
    "            wd:{ID} rdfs:label ?itemLabel.\n",
    "            FILTER(LANG(?itemLabel) = \"en\")\n",
    "        }}\n",
    "        '''\n",
    "        results = self.run_query(query)\n",
    "        return results[\"results\"][\"bindings\"][0][\"itemLabel\"][\"value\"]\n",
    "    def find_uri_by_label(self, label):\n",
    "        '''\n",
    "        Description:\n",
    "            Takes in label and outputs its URI\n",
    "        \n",
    "        Arguments:\n",
    "            label:string\n",
    "        \n",
    "        Returns:\n",
    "            uri:string - 'http://www.wikidata.org/entity/XXXXXXX'\n",
    "        '''\n",
    "        \n",
    "        # Create SPARQL query to find the URI for a given label\n",
    "        query = f'''SELECT ?item WHERE {{ \n",
    "                    ?item rdfs:label \"{label.replace('\"', '\\\"')}\"@en.\n",
    "                    SERVICE wikibase:label {{ bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }} \n",
    "                }} LIMIT 1'''\n",
    "        \n",
    "        try:\n",
    "            results = self.run_query(query)\n",
    "\n",
    "            # The first matching URI\n",
    "            binding = results[\"results\"][\"bindings\"][0]\n",
    "            result = binding[\"item\"][\"value\"]\n",
    "            return result\n",
    "        except Exception as e:\n",
    "            print(f\"An error occurred: {e}\")\n",
    "            return None\n",
    "    def find_ID_by_label(self, label, user_input=False):\n",
    "        '''\n",
    "        Description:\n",
    "            Takes in label and outputs its ID\n",
    "        \n",
    "        Arguments:\n",
    "            label:string\n",
    "            user_input:bool - True if the label is from the user\n",
    "        \n",
    "        Returns:\n",
    "            id:string - 'QXXXXXX'\n",
    "        '''\n",
    "        if user_input:\n",
    "            id = self.disambiguater.getCollectAnswerQid(label)\n",
    "        else:\n",
    "            uri = self.find_uri_by_label(label)\n",
    "            id = uri.split(\"/\")[-1]\n",
    "        return id\n",
    "    def find_ID_by_uri(self, uri):\n",
    "        '''\n",
    "        Description:\n",
    "            Takes in uri and outputs its ID\n",
    "        \n",
    "        Arguments:\n",
    "            uri:string - http://www.wikidata.org/entity/QXXXXX or http://www.wikidata.org/prop/direct/PXXXXX \n",
    "        \n",
    "        Returns:\n",
    "            id:string - 'Q/PXXXXXX'\n",
    "        '''\n",
    "        return uri.split('/')[-1]\n",
    "    def process_JSON(self, results_JSON, desired_variables):\n",
    "        '''\n",
    "        Description:\n",
    "            Takes in output of a query and returns the desired outputs\n",
    "        \n",
    "        Arguments:\n",
    "            results_JSON:JSON\n",
    "            desired_variables:List(string) - variables wanted from output \n",
    "        \n",
    "        Returns:\n",
    "            results:List(ID)\n",
    "        '''\n",
    "        results = []\n",
    "        for c in results_JSON['results']['bindings']:\n",
    "            r = []\n",
    "            for variable in desired_variables:\n",
    "                r.append(self.find_ID_by_uri(c[variable]['value']))\n",
    "            results.append(r)\n",
    "\n",
    "        return results\n",
    "    def random_items(self, items, count):\n",
    "        '''\n",
    "        Description:\n",
    "            Takes in a list of items and outputs a random subset of them\n",
    "        \n",
    "        Arguments:\n",
    "            items:list\n",
    "            count:int\n",
    "        \n",
    "        Returns:\n",
    "            selected:list() - List of count items\n",
    "        '''\n",
    "        \n",
    "        selected = random.sample(items, count)\n",
    "        return selected\n",
    "\n",
    "    def sister_category(self, categoryID, avoided_elementIDs, included_elementIDs=[], n_items=3):\n",
    "        '''\n",
    "        Description:\n",
    "            Takes in category and element IDs and outputs related categories that don't contain the element\n",
    "        \n",
    "        Arguments:\n",
    "            categoryID:string\n",
    "            avoided_elementIDs:list(string) - elements the category shouldn't cover\n",
    "            included_elementIDs:list(string) - elements the category should cover - unimplemented\n",
    "            n_items:int\n",
    "        \n",
    "        Returns:\n",
    "            results:List(ID) - IDs of Sister categories of categoryID\n",
    "            preds:List(ID) - IDS of predicates corresponding to results\n",
    "            \n",
    "        '''\n",
    "        # Prepare elements\n",
    "        avoided_element_queries = \"\"\n",
    "        for elementID in avoided_elementIDs:\n",
    "            avoided_element_queries += f'wd:{elementID} ?predicates ?category.\\n'\n",
    "        \n",
    "        # included_element_queries = \"\"\n",
    "        # if len(included_elementIDs) != 0:\n",
    "        #     # included_element_queries += \"VALUES ?includedElements {\"\n",
    "        #     for elementID in included_elementIDs:\n",
    "        #         included_element_queries += f'wd:{elementID} '\n",
    "        #     # included_element_queries += \"}\\n\"\n",
    "        #     # included_element_queries += \"?includedElements ?predicates ?category.\\n\"\n",
    "            \n",
    "\n",
    "\n",
    "        # Make query\n",
    "        desired_variables = [\"category\", \"predicate\"]\n",
    "        query = f'''\n",
    "                SELECT ?category ?categoryLabel ?predicate WHERE {{\n",
    "                    SERVICE wikibase:label {{ bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }}\n",
    "                    VALUES ?predicates {{ {self.sister_predicates} }}\n",
    "                    wd:{categoryID} ?predicates ?superCategory.\n",
    "                    ?category ?predicates ?superCategory.\n",
    "\n",
    "                    #VALUES ?includedElements {{ included_element_queries }}\n",
    "                    #?includedElements ?predicates ?category.\n",
    "\n",
    "                    FILTER(?category != wd:{categoryID})\n",
    "                    FILTER NOT EXISTS {{\n",
    "                        {avoided_element_queries}\n",
    "                    }}\n",
    "                \n",
    "                    ?superCategory rdfs:label ?superCategoryLabel .\n",
    "                    FILTER(LANG(?superCategoryLabel) = \"en\")\n",
    "                    ?category rdfs:label ?categoryLabel .\n",
    "                    FILTER(LANG(?categoryLabel) = \"en\")\n",
    "                    BIND(?predicates AS ?predicate)\n",
    "  \n",
    "                }}\n",
    "                LIMIT {n_items}\n",
    "                #GROUP BY ?category ?categoryLabel\n",
    "                #HAVING (COUNT(?includedElements) = {len(included_elementIDs)})\n",
    "        '''\n",
    "        \n",
    "        results = self.run_query(query)\n",
    "        \n",
    "        results = self.process_JSON(results, desired_variables)\n",
    "        return [r[0] for r in results], [r[1] for r in results]\n",
    "    def sister_element(self, elementID, categoryID, exceptions=[], n_items=100):\n",
    "        '''\n",
    "        Description:\n",
    "            Takes in element's ID and its category's ID and outputs related elements not in said category\n",
    "        \n",
    "        Arguments:\n",
    "            elementID:string - \"QXXXXX\"\n",
    "            categoryID:string - \"QXXXXX\"\n",
    "            exceptions: list \n",
    "            n_items:int\n",
    "        \n",
    "        Returns:\n",
    "            results:List(ID) - IDs of Sister topics of label\n",
    "        '''\n",
    "        \n",
    "        #exeptions = [f'FILTER NOT EXISTS {{?item {exception} .}}\\n' for exception in exceptions]\n",
    "        exception_patterns = []\n",
    "        exception_index = 0\n",
    "        for exception in exceptions:\n",
    "            predicate, object = exception.split()\n",
    "            \n",
    "            pattern = f\"\"\"FILTER NOT EXISTS {{\n",
    "                            ?sisterElement {predicate} ?exceptionCategory{exception_index} .\n",
    "                            ?exceptionCategory{exception_index} (wdt:P279)* {object} .\n",
    "                        }}\\n\"\"\"\n",
    "            exception_patterns.append(pattern)\n",
    "            exception_index += 1\n",
    "\n",
    "        exceptions_string = \"\".join(exception_patterns)\n",
    "\n",
    "        # Get Sister Catgeories\n",
    "        sister_categories, sister_preds = self.sister_category(categoryID, [elementID], n_items=n_items)\n",
    "        sister_preds = list(set(sister_preds))\n",
    "        # Note: sister_preds[i] represents the predicate used to find sister_categories[i]\n",
    "        '''\n",
    "        Example:\n",
    "        Some superCategory is a category that categoryID is within based on sister_preds[i]\n",
    "        sister_categories[i] is in superCategory based on sister_preds[i]\n",
    "\n",
    "        Thus, to find a sister of elementID (more like cousin), the sister_element must be within sister_categories[i] based on sister_preds[i]\n",
    "\n",
    "        So, let's say the category is team sports.. Team sports is a SUBCLASS_OF sports.\n",
    "        Animal sports is a SUBCLASS_OF sports\n",
    "        Horse racing is a SUBCLASS_OF animal sports\n",
    "\n",
    "        In that example:\n",
    "        categoryID = team sports\n",
    "        superCategory = sports\n",
    "        sister_category[i] = animal sports\n",
    "        sister_preds[i] = SUBCLASS_OF\n",
    "        sister of elementID = horse racing\n",
    "\n",
    "        Using sister_preds ensures that the sister_elements generated are closer to elementID\n",
    "        '''\n",
    "\n",
    "        #SPARQL query to find elements that are similar to the elementID but not in categoryID\n",
    "        desired_variables = [\"sisterElement\"]\n",
    "        query = f'''\n",
    "        SELECT ?sisterElement ?sisterElementLabel WHERE {{\n",
    "            VALUES ?predicates {{ {\"\".join([f'wdt:{p} ' for p in sister_preds])} }}\n",
    "            VALUES ?sisterCategories {{ {\"\".join([f\"wd:{sister} \" for sister in sister_categories])} }}\n",
    "            \n",
    "            SERVICE wikibase:label {{ bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }}\n",
    "            ?sisterElement ?predicates ?sisterCategories.\n",
    "            ?sisterElement rdfs:label ?sisterElementLabel.\n",
    "\n",
    "            FILTER(LANG(?sisterElementLabel) = \"en\")\n",
    "            FILTER(?sisterElement != wd:{elementID})\n",
    "            {exceptions_string}\n",
    "            \n",
    "        }}\n",
    "        \n",
    "        LIMIT {n_items}\n",
    "        '''\n",
    "        \n",
    "        results = self.run_query(query)\n",
    "        results = self.process_JSON(results, desired_variables)\n",
    "\n",
    "        return [r[0] for r in results]\n",
    "        \n",
    "    \n",
    "    # Printing Methods\n",
    "    def display_as_table(self, results, n_items):\n",
    "        '''\n",
    "        Description:\n",
    "            Creates a table of the n_items of the queried results\n",
    "        \n",
    "        Arguments:\n",
    "            results:JSON - sister topics\n",
    "            n_items:int\n",
    "        \n",
    "        Returns:\n",
    "            None\n",
    "        '''\n",
    "        df = pandas.DataFrame.from_dict(results[\"results\"][\"bindings\"][:n_items])\n",
    "        df = df.applymap(lambda x: x[\"value\"])\n",
    "        pandas.set_option('display.max_rows', n_items) # n_items doesnt work here\n",
    "        print(df)\n",
    "    def print_question(self, question):\n",
    "        '''\n",
    "        Description:\n",
    "            Prints the question\n",
    "        \n",
    "        Arguments:\n",
    "            question:Question\n",
    "        \n",
    "        Returns:\n",
    "            None\n",
    "        '''\n",
    "        print(f\"Which of the following is a {self.find_label_by_ID(question.relation.predicate)} {self.find_label_by_ID(question.relation.object)}?\")\n",
    "       \n",
    "        print(question.all_answers)\n",
    "        for index, answer in enumerate(question.all_answers):\n",
    "            print(f\"{index + 1}. {self.find_label_by_ID(answer)}\")\n",
    "   \n",
    "    # Element-> Category+Elements Question Methods\n",
    "    '''\n",
    "    Which of the following is a subclass of Olympic sport?\n",
    "    1. savika\n",
    "    2. *baseball*\n",
    "    3. memory sport\n",
    "    4. snowshoe biathlon\n",
    "    '''\n",
    "    def get_category_relation(self, label):\n",
    "        '''\n",
    "        Description:\n",
    "            Takes in label and outputs one of its categories in the form of a relation\n",
    "            Relations are pairs of predicates and objects\n",
    "\n",
    "        Arguments:\n",
    "            label:string\n",
    "        \n",
    "        Returns:\n",
    "            Relation object\n",
    "        '''\n",
    "        topicID = self.find_ID_by_label(label)\n",
    "        # Randomly choose a ?predicate ?object pair\n",
    "        desired_variables = [\"predicate\", \"object\"]\n",
    "        query = f'''\n",
    "        SELECT ?predicate ?object WHERE {{\n",
    "            VALUES ?predicate {{ {self.sister_predicates} }}\n",
    "            \n",
    "            ?object rdfs:label ?label.\n",
    "            wd:{topicID} ?predicate ?object.\n",
    "            SERVICE wikibase:label {{ bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }}\n",
    "        }}\n",
    "        ORDER BY RAND()\n",
    "        '''\n",
    "        #print(query)\n",
    "        results = self.process_JSON(self.run_query(query), desired_variables)\n",
    "        random_relation = self.random_items(results, count=1)[0]\n",
    "\n",
    "        return question.Relation(random_relation[0], random_relation[1])\n",
    "    def classic_sister_topic(self, label, exceptions=[], n_items=100, fast_mode=True):\n",
    "        '''\n",
    "        Description:\n",
    "            Takes in label and outputs n_items related topics\n",
    "        \n",
    "        Arguments:\n",
    "            label:string\n",
    "            exceptions: list of relations\n",
    "            n_items:int\n",
    "        \n",
    "        Returns:\n",
    "            results:JSON - Sister topics of label\n",
    "            \n",
    "        '''\n",
    "        topicID = self.find_ID_by_label(label)\n",
    "        \n",
    "        if fast_mode:\n",
    "            exeptions = [f'FILTER NOT EXISTS {{?item {exception} .}}\\n' for exception in exceptions]\n",
    "        else:\n",
    "            exeptions = [f'FILTER NOT EXISTS {{{self.check_answer_is_correct_pattern_r(\"?item\", exception)}}}\\n' for exception in exceptions]\n",
    "        \n",
    "        \n",
    "        #SPARQL query to find topics that are similar to the given topic\n",
    "        query = f'''\n",
    "        SELECT DISTINCT ?item WHERE {{\n",
    "            VALUES ?predicates {{ {self.sister_predicates} }}\n",
    "            wd:{topicID} ?predicates ?class.\n",
    "            ?item ?predicates ?class.\n",
    "            ?item rdfs:label ?label.\n",
    "\n",
    "            FILTER(LANG(?label) = \"en\")\n",
    "            FILTER(?item != wd:{topicID})\n",
    "            {\"\\n\".join(exeptions)}\n",
    "            SERVICE wikibase:label {{ bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }}\n",
    "        }}\n",
    "        {\"\" if fast_mode else \"ORDER BY RAND()\"}\n",
    "        LIMIT {n_items}\n",
    "        '''\n",
    "        #print(query)\n",
    "        results = self.run_query(query)\n",
    "        return results\n",
    "    def random_sister_topic(self, sister_json, count):\n",
    "        '''\n",
    "        Description:\n",
    "            Takes in a json of sister topics and outputs a list of random topic Q number strings\n",
    "        \n",
    "        Arguments:\n",
    "            sister_json:JSON\n",
    "            count:int\n",
    "        \n",
    "        Returns:\n",
    "            list of Q numbers\n",
    "        '''\n",
    "        sister_topics = sister_json[\"results\"][\"bindings\"]\n",
    "        random_sister_topics = random.sample(sister_topics, count)\n",
    "        return [topic[\"item\"][\"value\"].split(\"/\")[-1] for topic in random_sister_topics]\n",
    "    \n",
    "    def element_question(self, element_label, num_wrong_answers=3, fast_mode=True):\n",
    "        '''\n",
    "        Description:\n",
    "           Creates a question with the element as the correct answer\n",
    "        \n",
    "        Arguments:\n",
    "            element_label:string\n",
    "            num_wrong_answers:int\n",
    "        \n",
    "        Returns:\n",
    "            question:Question\n",
    "        '''\n",
    "        elementID = self.find_ID_by_label(element_label, user_input=True)\n",
    "        \n",
    "        relation = self.get_category_relation(element_label)\n",
    "        categoryID = relation.object\n",
    "        wrong_answers = self.classic_sister_topic(element_label, [relation], num_wrong_answers, fast_mode)\n",
    "\n",
    "        selected_answers = self.random_sister_topic(wrong_answers, num_wrong_answers)\n",
    "        relation = question.Relation( relation.predicate, relation.object)\n",
    "        return question.Question(relation, elementID, selected_answers)\n",
    "    def check_answer_is_correct_pattern_r(self, possible_answer, relation):\n",
    "        return self.check_answer_is_correct_pattern(possible_answer, \"wdt:\" + relation.predicate, \"wd:\" + relation.object)\n",
    "    def check_answer_is_correct_pattern(self, possible_answer, predicate, object):\n",
    "        '''\n",
    "        Description:\n",
    "            Takes in possible answer and relation and generates a pattern to check if the answer is correct\n",
    "            \n",
    "        Arguments:\n",
    "            possible_answer:string\n",
    "            relation:Relation\n",
    "            If variable ?v. If QID wd:QID. I can't append wd to things arbitrarily because I want this to handle variables or QIDs\n",
    "            Similar for predicates and objects\n",
    "        Returns:\n",
    "            string - SPARQL query pattern\n",
    "        '''\n",
    "        # I don't like this system. There's probably a better way in SPARQL\n",
    "        uniqueness_num = self.check_answer_is_correct_pattern_num_runs\n",
    "\n",
    "        predicate_then_subclassstar = f\"\"\"{possible_answer} {predicate} ?checkAnswerIntermediate{uniqueness_num} .\n",
    "                                            ?checkAnswerIntermediate{uniqueness_num} (wdt:P279)* {object} .\"\"\"\n",
    "        # predicate is occupation. Check if possible_answer has a field of work practiced by object\n",
    "        subclassstar = f\"\"\"{possible_answer} {wikidata_properties['subclass_of']}* {object} .\"\"\"\n",
    "        field_of_work_occupation = f\"\"\"#check if predicate is occupation\n",
    "                                    FILTER({predicate} = {wikidata_properties['occupation']})\n",
    "                                    {possible_answer} {wikidata_properties['field_of_work']} ?checkAnswerField{uniqueness_num} .\n",
    "                                    ?checkAnswerField{uniqueness_num} {wikidata_properties[\"practiced by\"]} {object} .\"\"\"\n",
    "        # Append the patterns to a list\n",
    "        patterns = []\n",
    "        patterns.append(predicate_then_subclassstar)\n",
    "        patterns.append(field_of_work_occupation)\n",
    "        patterns.append(subclassstar)\n",
    "        # UNION the patterns together\n",
    "        # put curly braces around the patterns\n",
    "        patterns = [f\"{{{pattern}}}\" for pattern in patterns]\n",
    "        # join the patterns with a newline and a UNION\n",
    "        patterns = \"\\nUNION\\n\".join(patterns)\n",
    "        #print(patterns)\n",
    "        self.check_answer_is_correct_pattern_num_runs += 1\n",
    "        return patterns\n",
    "    def check_answer_using_pattern(self, possible_answer, relation):\n",
    "        '''\n",
    "        Description:\n",
    "            Takes in possible answer and relation and checks if the answer is correct\n",
    "        \n",
    "        Arguments:\n",
    "            possible_answer:string\n",
    "            relation:Relation\n",
    "        \n",
    "        Returns:\n",
    "            boolean\n",
    "        '''\n",
    "        patterns = self.check_answer_is_correct_pattern_r(\"wd:\" + possible_answer, relation)\n",
    "        query = f'''\n",
    "        ASK WHERE {{\n",
    "            {patterns}\n",
    "        }}\n",
    "        '''\n",
    "        #print(query)\n",
    "        results = self.run_query(query)\n",
    "        return results['boolean']\n",
    "    \n",
    "    # Element(s) -> Categories Question Methods\n",
    "    '''\n",
    "    Which of the following is a category baseball, volleyball, basketball, and cricket all belong to?\n",
    "    1. sport in ancient Greece\n",
    "    2. *team sport*\n",
    "    3. racing sports\n",
    "    4. sport in Europe\n",
    "    '''\n",
    "    def find_category(self, elementIDs, predicateID=SUBCLASS_OF):\n",
    "        '''\n",
    "        Description:\n",
    "            Inputs element IDs and outputs a category ID that they all belong to based on the predicate\n",
    "        \n",
    "        Arguments:\n",
    "            elementIDs:list(string)\n",
    "            predicateID:string\n",
    "        \n",
    "        Returns:\n",
    "            random_categoryID:string -  random category that elementID belongs to\n",
    "        '''\n",
    "        # Prepare elements\n",
    "        element_queries = \"\".join([f\"wd:{e} \" for e in elementIDs]) # wd:QXXXX for every element\n",
    "        \n",
    "        # Prepare query\n",
    "        desired_variables = [\"category\"]\n",
    "        query = f'''\n",
    "        SELECT ?category ?label (COUNT(?elements) as ?elementCount) WHERE {{\n",
    "            VALUES ?elements {{ {element_queries} }}\n",
    "            ?elements wdt:{predicateID} ?category.\n",
    "            ?category rdfs:label ?label.\n",
    "\n",
    "            SERVICE wikibase:label {{ bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }}\n",
    "            FILTER(LANG(?label) = \"en\")\n",
    "        }}\n",
    "        GROUP BY ?category ?label\n",
    "        HAVING (COUNT(?elements) = {len(elementIDs)})\n",
    "        '''\n",
    "           \n",
    "        categories = self.process_JSON(self.run_query(query), desired_variables)\n",
    "        if len(categories) == 0:\n",
    "            print(query)\n",
    "            raise Exception(\"These elements do not have a shared category\")\n",
    "        categories = [c[0] for c in categories]\n",
    "        random_categoryID = self.random_items(categories, count=1)[0]\n",
    "        \n",
    "        return random_categoryID\n",
    "    def print_category_question(self, element_labels, answers, correct_answer):\n",
    "        '''\n",
    "        Description:\n",
    "            Takes in question features and prompts the user with them\n",
    "        \n",
    "        Arguments:\n",
    "            element_labels:list(string)\n",
    "            answers:list(string) - List of IDs\n",
    "            correct_answer:string - ID of answer\n",
    "        \n",
    "        Returns:\n",
    "            None\n",
    "        '''\n",
    "        # Prepare Questions\n",
    "        q = \"Which of the following is a category that \"\n",
    "        i=0\n",
    "        while i < len(element_labels) - 1:\n",
    "            q += f\"{element_labels[i]}, \"\n",
    "            i+=1\n",
    "        \n",
    "        if len(element_labels) == 1:\n",
    "            q += f\"{element_labels[i]} belongs to\"\n",
    "        else:\n",
    "            q += f\"and {element_labels[i]} all belong to\"\n",
    "        print(q)\n",
    "\n",
    "        # Print Answers\n",
    "        for index, answer in enumerate(answers):\n",
    "            print(f\"{index + 1}. {self.find_label_by_ID(answer)}\")\n",
    "        time.sleep(0.2)\n",
    "\n",
    "        # Input answer and output result\n",
    "        user_answer = int(input(\"What is your answer?\")) - 1\n",
    "        if answers[user_answer] == correct_answer:\n",
    "            print(\"You are correct!\")\n",
    "        else:\n",
    "            print(\"You are incorrect!\")\n",
    "    def category_question(self, element_labels, num_wrong_answers=3):\n",
    "        '''\n",
    "        Description:\n",
    "            Inputs elements and finds 4 categories, one being the one that contains every element\n",
    "            Then prints the question\n",
    "        \n",
    "        Arguments:\n",
    "            element_labels:list(string)\n",
    "            num_wrong_answers:int\n",
    "        \n",
    "        Returns:\n",
    "            None\n",
    "        '''\n",
    "        # Get category of the elements\n",
    "        elementIDs = []\n",
    "        for element_label in element_labels:\n",
    "            elementIDs.append(self.find_ID_by_label(element_label, user_input=True))\n",
    "        categoryID = self.find_category(elementIDs) # Default is SUBCLASS_OF\n",
    "        \n",
    "        # Get 3 other sister categories that are similar, but not the correct answer\n",
    "        results, _ = self.sister_category(categoryID, elementIDs, n_items=num_wrong_answers) \n",
    "        answers = results + [categoryID]\n",
    "        random.shuffle(answers)\n",
    "\n",
    "        # Return the 3 sisters and the correct category\n",
    "        self.print_category_question(element_labels, answers, categoryID)\n",
    "        # return categoryID, results, correct_answer_idx, \n",
    "      \n",
    "    "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 102,
   "metadata": {},
   "outputs": [],
   "source": [
    "named_after = \"wdt:P138\"\n",
    "occupation = \"wdt:P106\"\n",
    "has_use = \"wdt:P366\"\n",
    "studied_in = \"wdt:P2579\"\n",
    "country = \"wdt:P17\"\n",
    "member_of = \"wdt:P463\"\n",
    "sensible_sister_predicates = f\"wdt:P279 wdt:P101 wdt:P361 wdt:P921 wdt:P150 {named_after} {occupation} {has_use} {studied_in} {country} {member_of}\"\n",
    "\n",
    "generator = Generator(sister_predicates=sensible_sister_predicates)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 103,
   "metadata": {},
   "outputs": [],
   "source": [
    "def question_answer(question):\n",
    "    generator.print_question(question)\n",
    "    time.sleep(0.2)\n",
    "\n",
    "    answer = int(input(\"What is your answer?\")) - 1\n",
    "    user_answer = generator.find_label_by_ID(question.all_answers[answer])\n",
    "    print(f\"Your answer was {user_answer}\")\n",
    "    was_correct = generator.check_answer_using_pattern(question.all_answers[answer], question.relation)\n",
    "    #print(f\"The correct answer was {correct_answer}\")\n",
    "    if was_correct:\n",
    "        print(\"You are correct!\")\n",
    "    else:\n",
    "        print(\"You are incorrect!\")\n",
    "    "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "- Multiple Items came up when you searched ' baseball , Did you mean:\n",
      "- 1 American-originated sport in which teams compete to score runs by hitting a thrown ball and advancing around bases\n",
      "- 2 North American professional baseball league\n",
      "- 3 ball used in the sport of baseball\n",
      "- 4 baseball league representing the highest level of professional baseball in Japan\n",
      "- 5 Baseball statistics website\n",
      "- 6 Finnish baseball\n",
      "- 7 person who plays games of baseball\n",
      "- 8 1983 baseball video game for the NES\n",
      "- 9 park used to play the game of baseball\n",
      "- 10 player responsible for throwing (&quot;pitching&quot;) the ball to the batters in a game of baseball or softball\n",
      "The user input is: 1\n",
      "The selected answer: American-originated sport in which teams compete to score runs by hitting a thrown ball and advancing around bases and the Qid: Q5369\n",
      "- Multiple Items came up when you searched ' volleyball , Did you mean:\n",
      "- 1 team sport\n",
      "- 2 ball used in volleyball\n",
      "- 3 international governing body for the sport of indoor, beach and grass volleyball\n",
      "- 4 team sport\n",
      "- 5 governing body for the sport of volleyball in Europe\n",
      "- 6 sportsperson who plays volleyball\n",
      "- 7 volleyball and beach volleyball played during the 2016 Summer Olympics\n",
      "- 8 1986 volleyball video game\n",
      "- 9 volleyball practiced by women\n",
      "- 10 volleyball practiced by men\n",
      "The user input is: 1\n",
      "The selected answer: team sport and the Qid: Q1734\n",
      "Which of the following is a category that baseball, and volleyball all belong to\n",
      "1. Olympic sport\n",
      "2. mind sport\n",
      "3. relay race\n",
      "4. animal sports\n",
      "You are incorrect!\n"
     ]
    }
   ],
   "source": [
    "cat_q = generator.category_question([\"baseball\", \"volleyball\"])\n",
    "# question_answer(cat_q)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 107,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "- Multiple Items came up when you searched ' Paris , Did you mean:\n",
      "- 1 association football club in Paris, France\n",
      "- 2 capital of France\n",
      "- 3 county seat of Lamar County, Texas, United States\n",
      "- 4 mythological son of Priam, king of Troy\n",
      "- 5 county seat of Bourbon County, Kentucky, United States\n",
      "- 6 city in and the county seat of Henry County, Tennessee, United States\n",
      "- 7 administrative district of Paris\n",
      "- 8 genus of plants\n",
      "- 9 municipal district of Paris, France\n",
      "- 10 rapid transport system of Paris, France\n",
      "The user input is: 2\n",
      "The selected answer: capital of France and the Qid: Q90\n",
      "\n",
      "        SELECT DISTINCT ?item WHERE {\n",
      "            VALUES ?predicates { wdt:P279 wdt:P101 wdt:P361 wdt:P921 wdt:P150 wdt:P138 wdt:P106 wdt:P366 wdt:P2579 wdt:P17 wdt:P463 }\n",
      "            wd:Q90 ?predicates ?class.\n",
      "            ?item ?predicates ?class.\n",
      "            ?item rdfs:label ?label.\n",
      "\n",
      "            FILTER(LANG(?label) = \"en\")\n",
      "            FILTER(?item != wd:Q90)\n",
      "            FILTER NOT EXISTS {?item wdt:P361 wd:Q13917 .}\n",
      "\n",
      "            SERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n",
      "        }\n",
      "        \n",
      "        LIMIT 3\n",
      "        \n"
     ]
    }
   ],
   "source": [
    "my_question = generator.element_question(\"Paris\", 3, fast_mode=True)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 108,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Which of the following is a part of Île-de-France?\n",
      "['Q150', 'P268', 'Q142', 'Q90']\n",
      "1. French\n",
      "2. Bibliothèque nationale de France ID\n",
      "3. France\n",
      "4. Paris\n",
      "Your answer was Paris\n",
      "You are correct!\n"
     ]
    }
   ],
   "source": [
    "question_answer(my_question)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "krr",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.12.1"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
