{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 186,
   "metadata": {},
   "outputs": [],
   "source": [
    "import requests\n",
    "from SPARQLWrapper import SPARQLWrapper, JSON\n",
    "import pandas\n",
    "import question\n",
    "import random"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 187,
   "metadata": {},
   "outputs": [],
   "source": [
    "# Predicates\n",
    "SUBCLASS_OF = \"P279\"\n",
    "PART_OF = \"P361\"\n",
    "INSTANCE_OF = \"P31\"\n",
    "\n",
    "predicates = [SUBCLASS_OF, PART_OF, INSTANCE_OF]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 211,
   "metadata": {},
   "outputs": [],
   "source": [
    "# Category Example: Team Sports\n",
    "# Element Example: Baseball\n",
    "\n",
    "class Generator:\n",
    "    def __init__(self, sister_predicates):\n",
    "        self.sparql = SPARQLWrapper(\"https://query.wikidata.org/sparql\")\n",
    "        self.sister_predicates = sister_predicates\n",
    "    \n",
    "    # SPARQL Helper Methods\n",
    "    def run_query(self, query):\n",
    "        '''\n",
    "        Description:\n",
    "            Takes in query and requests its output\n",
    "        \n",
    "        Arguments:\n",
    "            query:string\n",
    "        \n",
    "        Returns:\n",
    "            results:JSON\n",
    "        '''\n",
    "        # Set the query and the return format (JSON)\n",
    "        self.sparql.setQuery(query)\n",
    "        self.sparql.setReturnFormat(JSON)\n",
    "\n",
    "        # Perform the query and convert the result to a Python dictionary\n",
    "        results = self.sparql.query().convert()\n",
    "        return results \n",
    "    def find_label_by_ID(self, ID):\n",
    "        '''\n",
    "        Description:\n",
    "            Takes in QID and outputs its label\n",
    "        \n",
    "        Arguments:\n",
    "            ID:string - \"QXXXXX\"\n",
    "        \n",
    "        Returns:\n",
    "            label:string\n",
    "        '''\n",
    "        query = f'''\n",
    "        SELECT ?itemLabel WHERE {{\n",
    "            wd:{ID} rdfs:label ?itemLabel.\n",
    "            FILTER(LANG(?itemLabel) = \"en\")\n",
    "        }}\n",
    "        '''\n",
    "        results = self.run_query(query)\n",
    "        return results[\"results\"][\"bindings\"][0][\"itemLabel\"][\"value\"]\n",
    "    def find_uri_by_label(self, label):\n",
    "        '''\n",
    "        Description:\n",
    "            Takes in label and outputs its URI\n",
    "        \n",
    "        Arguments:\n",
    "            label:string\n",
    "        \n",
    "        Returns:\n",
    "            uri:string - 'http://www.wikidata.org/entity/XXXXXXX'\n",
    "        '''\n",
    "        \n",
    "        # Create SPARQL query to find the URI for a given label\n",
    "        query = f'''SELECT ?item WHERE {{ \n",
    "                    ?item rdfs:label \"{label.replace('\"', '\\\"')}\"@en.\n",
    "                    SERVICE wikibase:label {{ bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }} \n",
    "                }} LIMIT 1'''\n",
    "        \n",
    "        try:\n",
    "            results = self.run_query(query)\n",
    "\n",
    "            # The first matching URI\n",
    "            binding = results[\"results\"][\"bindings\"][0]\n",
    "            result = binding[\"item\"][\"value\"]\n",
    "            return result\n",
    "        except Exception as e:\n",
    "            print(f\"An error occurred: {e}\")\n",
    "            return None\n",
    "    def find_ID_by_label(self, label):\n",
    "        '''\n",
    "        Description:\n",
    "            Takes in label and outputs its ID\n",
    "        \n",
    "        Arguments:\n",
    "            label:string\n",
    "        \n",
    "        Returns:\n",
    "            id:string - 'QXXXXXX'\n",
    "        '''\n",
    "        uri = self.find_uri_by_label(label)\n",
    "        id = uri.split(\"/\")[-1]\n",
    "        return id\n",
    "    def find_ID_by_uri(self, uri):\n",
    "        '''\n",
    "        Description:\n",
    "            Takes in uri and outputs its ID\n",
    "        \n",
    "        Arguments:\n",
    "            uri:string - http://www.wikidata.org/entity/QXXXXX or http://www.wikidata.org/prop/direct/PXXXXX \n",
    "        \n",
    "        Returns:\n",
    "            id:string - 'Q/PXXXXXX'\n",
    "        '''\n",
    "        return uri.split('/')[-1]\n",
    "    def process_JSON(self, results_JSON, desired_variables):\n",
    "        '''\n",
    "        Description:\n",
    "            Takes in output of a query and returns the desired outputs\n",
    "        \n",
    "        Arguments:\n",
    "            results_JSON:JSON\n",
    "            desired_variables:List(string) - variables wanted from output \n",
    "        \n",
    "        Returns:\n",
    "            results:List(ID)\n",
    "        '''\n",
    "        results = []\n",
    "        for c in results_JSON['results']['bindings']:\n",
    "            r = []\n",
    "            for variable in desired_variables:\n",
    "                r.append(self.find_ID_by_uri(c[variable]['value']))\n",
    "            results.append(r)\n",
    "\n",
    "        return results\n",
    "    def random_items(self, items, count):\n",
    "        '''\n",
    "        Description:\n",
    "            Takes in a list of items and outputs a random subset of them\n",
    "        \n",
    "        Arguments:\n",
    "            items:list\n",
    "            count:int\n",
    "        \n",
    "        Returns:\n",
    "            selected:list() - List of count items\n",
    "        '''\n",
    "        \n",
    "        selected = random.sample(items, count)\n",
    "        return selected\n",
    "\n",
    "    def sister_category(self, categoryID, elementID, n_items=3):\n",
    "        '''\n",
    "        Description:\n",
    "            Takes in category and element IDS and outputs related categories that don't contain the element\n",
    "        \n",
    "        Arguments:\n",
    "            categoryID:string\n",
    "            elementID:string\n",
    "            n_items:int\n",
    "        \n",
    "        Returns:\n",
    "            results:List(ID) - IDs of Sister categories of categoryID\n",
    "            preds:List(ID) - IDS of predicates corresponding to results\n",
    "            \n",
    "        '''\n",
    "        desired_variables = [\"category\", \"predicate\"]\n",
    "        query = f'''\n",
    "                SELECT ?category ?categoryLabel ?predicate WHERE {{\n",
    "                    SERVICE wikibase:label {{ bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }}\n",
    "                    VALUES ?predicates {{ {self.sister_predicates} }}\n",
    "                    wd:{categoryID} ?predicates ?superCategory.\n",
    "                    ?category ?predicates ?superCategory.\n",
    "                    FILTER(?category != wd:{categoryID})\n",
    "                    FILTER NOT EXISTS {{\n",
    "                        wd:{elementID} ?predicates ?category .\n",
    "                    }}\n",
    "                \n",
    "                    ?superCategory rdfs:label ?superCategoryLabel .\n",
    "                    FILTER(LANG(?superCategoryLabel) = \"en\")\n",
    "                    ?category rdfs:label ?categoryLabel .\n",
    "                    FILTER(LANG(?categoryLabel) = \"en\")\n",
    "                    BIND(?predicates AS ?predicate)\n",
    "  \n",
    "                }}\n",
    "                LIMIT {n_items}\n",
    "        '''\n",
    "        \n",
    "        results = self.run_query(query)\n",
    "        \n",
    "        results = self.process_JSON(results, desired_variables)\n",
    "        return [r[0] for r in results], [r[1] for r in results]\n",
    "    def sister_element(self, elementID, categoryID, exceptions=[], n_items=100):\n",
    "        '''\n",
    "        Description:\n",
    "            Takes in element's ID and its category's ID and outputs related elements not in said category\n",
    "        \n",
    "        Arguments:\n",
    "            elementID:string - \"QXXXXX\"\n",
    "            categoryID:string - \"QXXXXX\"\n",
    "            exceptions: list \n",
    "            n_items:int\n",
    "        \n",
    "        Returns:\n",
    "            results:List(ID) - IDs of Sister topics of label\n",
    "        '''\n",
    "        \n",
    "        #exeptions = [f'FILTER NOT EXISTS {{?item {exception} .}}\\n' for exception in exceptions]\n",
    "        exception_patterns = []\n",
    "        for exception in exceptions:\n",
    "            predicate, object = exception.split()\n",
    "            pattern = f\"\"\"FILTER NOT EXISTS {{\n",
    "                            ?sisterElement {predicate} ?exceptionCategory .\n",
    "                            ?exceptionCategory (wdt:P279)* {object} .\n",
    "                        }}\\n\"\"\"\n",
    "            exception_patterns.append(pattern)\n",
    "\n",
    "        exceptions_string = \"\".join(exception_patterns)\n",
    "\n",
    "        # Get Sister Catgeories\n",
    "        sister_categories, sister_preds = self.sister_category(categoryID, elementID, n_items)\n",
    "        sister_preds = list(set(sister_preds))\n",
    "        \n",
    "        #SPARQL query to find elements that are similar to the elementID but not in categoryID\n",
    "        desired_variables = [\"sisterElement\"]\n",
    "        query = f'''\n",
    "        SELECT ?sisterElement ?sisterElementLabel WHERE {{\n",
    "            VALUES ?predicates {{ {\"\".join([f'wdt:{p} ' for p in sister_preds])} }}\n",
    "            VALUES ?sisterCategories {{ {\"\".join([f\"wd:{sister} \" for sister in sister_categories])} }}\n",
    "            \n",
    "            SERVICE wikibase:label {{ bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }}\n",
    "            ?sisterElement ?predicates ?sisterCategories.\n",
    "            ?sisterElement rdfs:label ?sisterElementLabel.\n",
    "\n",
    "            FILTER(LANG(?sisterElementLabel) = \"en\")\n",
    "            FILTER(?sisterElement != wd:{elementID})\n",
    "            {exceptions_string}\n",
    "            \n",
    "        }}\n",
    "        \n",
    "        LIMIT {n_items}\n",
    "        '''\n",
    "        \n",
    "        results = self.run_query(query)\n",
    "        results = self.process_JSON(results, desired_variables)\n",
    "\n",
    "        return [r[0] for r in results]\n",
    "        \n",
    "    \n",
    "    # Printing Methods\n",
    "    def display_as_table(self, results, n_items):\n",
    "        '''\n",
    "        Description:\n",
    "            Creates a table of the n_items of the queried results\n",
    "        \n",
    "        Arguments:\n",
    "            results:JSON - sister topics\n",
    "            n_items:int\n",
    "        \n",
    "        Returns:\n",
    "            None\n",
    "        '''\n",
    "        df = pandas.DataFrame.from_dict(results[\"results\"][\"bindings\"][:n_items])\n",
    "        df = df.applymap(lambda x: x[\"value\"])\n",
    "        pandas.set_option('display.max_rows', n_items) # n_items doesnt work here\n",
    "        print(df)\n",
    "    def print_question(self, question):\n",
    "        '''\n",
    "        Description:\n",
    "            Prints the question\n",
    "        \n",
    "        Arguments:\n",
    "            question:Question\n",
    "        \n",
    "        Returns:\n",
    "            None\n",
    "        '''\n",
    "        print(f\"Which of the following is a {question.relation.predicate} {question.relation.object}?\")\n",
    "       \n",
    "        print(question.all_answers)\n",
    "        for index, answer in enumerate(question.all_answers):\n",
    "            print(f\"{index + 1}. {self.find_label_by_ID(answer)}\")\n",
    "   \n",
    "    # Element-> Category+Elements Questions Methods\n",
    "    def get_category_relation(self, label):\n",
    "        '''\n",
    "        Description:\n",
    "            Takes in label and outputs one of its categories in the form of a relation\n",
    "            Relations are pairs of predicates and objects\n",
    "\n",
    "        Arguments:\n",
    "            label:string\n",
    "        \n",
    "        Returns:\n",
    "            Relation object\n",
    "        '''\n",
    "        topicID = self.find_ID_by_label(label)\n",
    "        # Randomly choose a ?predicate ?object pair\n",
    "        desired_variables = [\"predicate\", \"object\"]\n",
    "        query = f'''\n",
    "        SELECT ?predicate ?object WHERE {{\n",
    "            VALUES ?predicate {{ {self.sister_predicates} }}\n",
    "            \n",
    "            ?object rdfs:label ?label.\n",
    "            wd:{topicID} ?predicate ?object.\n",
    "            SERVICE wikibase:label {{ bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }}\n",
    "        }}\n",
    "        '''\n",
    "        results = self.process_JSON(self.run_query(query), desired_variables)\n",
    "        random_relation = self.random_items(results, count=1)[0]\n",
    "\n",
    "        return question.Relation(random_relation[0], random_relation[1])\n",
    "    def element_question(self, element_label, num_wrong_answers=3):\n",
    "        '''\n",
    "        Description:\n",
    "           Creates a question with the element as the correct answer\n",
    "        \n",
    "        Arguments:\n",
    "            element_label:string\n",
    "            num_wrong_answers:int\n",
    "        \n",
    "        Returns:\n",
    "            question:Question\n",
    "        '''\n",
    "        elementID = self.find_ID_by_label(element_label)\n",
    "        \n",
    "        relation = self.get_category_relation(element_label)\n",
    "        categoryID = relation.object\n",
    "        wrong_answers = self.sister_element(elementID, categoryID, [str(relation)])\n",
    "\n",
    "        selected_answers = self.random_items(wrong_answers, count=num_wrong_answers)\n",
    "        relation = question.Relation( self.find_label_by_ID(relation.predicate), self.find_label_by_ID(relation.object))\n",
    "        return question.Question(relation, elementID, selected_answers)\n",
    "    \n",
    "    # Element -> Categories Questions Methods\n",
    "    def find_category(self, elementID, predicateID=SUBCLASS_OF):\n",
    "        '''\n",
    "        Description:\n",
    "            Inputs an element ID and outputs a category ID is belongs to based on the predicate\n",
    "        \n",
    "        Arguments:\n",
    "            elementID:string\n",
    "            predicateID:string\n",
    "        \n",
    "        Returns:\n",
    "            random_categoryID:string -  random category that elementID belongs to\n",
    "        '''\n",
    "        desired_variables = [\"category\"]\n",
    "        query = f'''\n",
    "        SELECT ?category ?label WHERE {{\n",
    "            wd:{elementID} wdt:{predicateID} ?category.\n",
    "            ?category rdfs:label ?label.\n",
    "\n",
    "            SERVICE wikibase:label {{ bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }}\n",
    "            FILTER(LANG(?label) = \"en\")\n",
    "        }}\n",
    "        '''\n",
    "           \n",
    "        categories = self.process_JSON(self.run_query(query), desired_variables)\n",
    "        categories = [c[0] for c in categories]\n",
    "        random_categoryID = self.random_items(categories, count=1)[0]\n",
    "        \n",
    "        return random_categoryID\n",
    "    def category_question(self, element_label, num_wrong_answers=3):\n",
    "        '''\n",
    "        Description:\n",
    "            Inputs an element and outputs 4 categories, one being the one that contains the element\n",
    "        \n",
    "        Arguments:\n",
    "            element_label:string\n",
    "        \n",
    "        Returns:\n",
    "            question:Question\n",
    "        '''\n",
    "        # Get category of the element\n",
    "            # Different predicates (i.e., instance of, subclass of) can be used for this. Maybe randomly select them?\n",
    "        elementID = self.find_ID_by_label(element_label)\n",
    "        categoryID = self.find_category(elementID) # Default is SUBCLASS_OF\n",
    "        \n",
    "        # Get 3 other sister categories that the element is not a part of\n",
    "        results, _ = self.sister_category(categoryID, elementID, n_items=num_wrong_answers)\n",
    "\n",
    "        # Return the 3 sisters and the correct category\n",
    "        relation = question.Relation(\"category\", f'{self.find_label_by_ID(elementID)} belongs to')\n",
    "        \n",
    "        return question.Question(relation, categoryID, results)\n",
    "    "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 189,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "What element do you want the correct answer to the question to be?: baseball\n",
      "How many questions do you want?: 3\n"
     ]
    }
   ],
   "source": [
    "print(\"What element do you want the correct answer to the question to be?\", end=\": \")\n",
    "element = input()\n",
    "print(element)\n",
    "print(\"How many questions do you want?\", end=\": \")\n",
    "num_questions = int(input())\n",
    "print(num_questions)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 212,
   "metadata": {},
   "outputs": [],
   "source": [
    "named_after = \"wdt:P138\"\n",
    "occupation = \"wdt:P106\"\n",
    "has_use = \"wdt:P366\"\n",
    "studied_in = \"wdt:P2579\"\n",
    "sensible_sister_predicates = f\"wdt:P279 wdt:P361 wdt:P101 wdt:P361 wdt:P921 wdt:P131 wdt:P150 {named_after} {occupation} {has_use} {studied_in}\"\n",
    "\n",
    "generator = Generator(sister_predicates=sensible_sister_predicates)\n",
    "# CHANGE the default SUBCLASS_OF for the cat_qs to the entire sister predicates"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 191,
   "metadata": {},
   "outputs": [],
   "source": [
    "import time\n",
    "def question_answer(question):\n",
    "    generator.print_question(question)\n",
    "    time.sleep(0.2)\n",
    "\n",
    "    answer = int(input(\"What is your answer?\")) - 1\n",
    "    user_answer = generator.find_label_by_ID(question.all_answers[answer])\n",
    "    print(f\"Your answer was {user_answer}\")\n",
    "    correct_answer = generator.find_label_by_ID(question.correct_answer)\n",
    "    print(f\"The correct answer was {correct_answer}\")\n",
    "    if user_answer == correct_answer:\n",
    "        print(\"You are correct!\")\n",
    "    else:\n",
    "        print(\"You are incorrect!\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 197,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "                SELECT ?category ?categoryLabel WHERE {\n",
      "                    SERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n",
      "                    VALUES ?predicates { wdt:P279 wdt:P361 wdt:P101 wdt:P361 wdt:P921 wdt:P131 wdt:P150 wdt:P138 wdt:P106 wdt:P366 wdt:P2579 }\n",
      "                    wd:Q216048 ?predicates ?superCategory.\n",
      "                    ?category ?predicates ?superCategory.\n",
      "                    FILTER(?category != wd:Q216048)\n",
      "                    FILTER NOT EXISTS {\n",
      "                        wd:Q5369 ?predicates ?category .\n",
      "                    }\n",
      "                \n",
      "                    ?superCategory rdfs:label ?superCategoryLabel .\n",
      "                    FILTER(LANG(?superCategoryLabel) = \"en\")\n",
      "                    ?category rdfs:label ?categoryLabel .\n",
      "                    FILTER(LANG(?categoryLabel) = \"en\")\n",
      "             \n",
      "  \n",
      "                }\n",
      "                LIMIT 3\n",
      "        \n",
      "Which of the following is a category baseball belongs to?\n",
      "['Q216048', 'Q1442043', 'Q1410068', 'Q1395783']\n",
      "1. team sport\n",
      "2. Fierljeppen\n",
      "3. fire-fighting sport\n",
      "4. senior sport\n",
      "Your answer was team sport\n",
      "The correct answer was team sport\n",
      "You are correct!\n"
     ]
    }
   ],
   "source": [
    "cat_q = generator.category_question(\"baseball\")\n",
    "question_answer(cat_q)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 213,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "        SELECT ?sisterElement ?sisterElementLabel WHERE {\n",
      "            VALUES ?predicates { wdt:P279  }\n",
      "            VALUES ?sisterCategories { wd:Q327742 wd:Q1060018 wd:Q1188693 wd:Q1478438 wd:Q2312410 wd:Q2755547 wd:Q5470256 wd:Q7128792 wd:Q7534137 wd:Q18385944  }\n",
      "            \n",
      "            SERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n",
      "            ?sisterElement ?predicates ?sisterCategories.\n",
      "            ?sisterElement rdfs:label ?sisterElementLabel.\n",
      "\n",
      "            FILTER(LANG(?sisterElementLabel) = \"en\")\n",
      "            FILTER(?sisterElement != wd:Q5369)\n",
      "            FILTER NOT EXISTS {\n",
      "                            ?sisterElement wdt:P279 ?exceptionCategory .\n",
      "                            ?exceptionCategory (wdt:P279)* wd:Q212434 .\n",
      "                        }\n",
      "\n",
      "            \n",
      "        }\n",
      "        \n",
      "        LIMIT 100\n",
      "        \n",
      "Which of the following is a subclass of Olympic sport?\n",
      "['Q89582128', 'Q5369', 'Q3479346', 'Q271277']\n",
      "1. rings\n",
      "2. baseball\n",
      "3. wushu\n",
      "4. savate\n",
      "Your answer was baseball\n",
      "The correct answer was baseball\n",
      "You are correct!\n"
     ]
    }
   ],
   "source": [
    "my_question = generator.element_question(element, 3)\n",
    "question_answer(my_question)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "\n",
    "def get_wikidata_item(item_id):\n",
    "    # Wikidata API endpoint\n",
    "    url = \"https://www.wikidata.org/w/api.php\"\n",
    "    \n",
    "    # Parameters for the API request\n",
    "    params = {\n",
    "        \"action\": \"wbgetentities\",  # Action to get data about entities\n",
    "        \"ids\": item_id,  # ID of the Wikidata item (e.g., Q64 for Berlin)\n",
    "        \"format\": \"json\",  # Response format\n",
    "        \"props\": \"labels|descriptions|aliases\",  # Properties to retrieve: labels, descriptions, and aliases\n",
    "        \"languages\": \"en\"  # Language filter\n",
    "    }\n",
    "    \n",
    "    # Make the GET request to the Wikidata API\n",
    "    response = requests.get(url, params=params)\n",
    "    \n",
    "    # Check if the request was successful\n",
    "    if response.status_code == 200:\n",
    "        # Parse the JSON response\n",
    "        data = response.json()\n",
    "        \n",
    "        # Access the item's data\n",
    "        item_data = data['entities'][item_id]\n",
    "        \n",
    "        # Extract and print the label, description, and aliases\n",
    "        label = item_data['labels']['en']['value']\n",
    "        description = item_data['descriptions']['en']['value']\n",
    "        aliases = [alias['value'] for alias in item_data['aliases']['en']]\n",
    "        \n",
    "        print(f\"Label: {label}\")\n",
    "        print(f\"Description: {description}\")\n",
    "        print(f\"Aliases: {', '.join(aliases)}\")\n",
    "    else:\n",
    "        print(\"Failed to retrieve data\")\n",
    "\n",
    "# Example usage\n",
    "get_wikidata_item(\"Q64\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "krr",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.12.1"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
